html/RStoolbox_0.01_(2014-5-6_by_).html
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> cloudMask.R</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param windowSize</span><span style="color: #daa520;">1</span><span style="color: #00bfff;"> odd number, rectangular moving window to remove clouds which arre too small (likely artefacts)</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param windowSize</span><span style="color: #daa520;">2</span><span style="color: #00bfff;"> odd number, rectangular buffer around cluster centers</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param sanitize logical. Should small clouds (possibly false positives) be removed by filtering? If \code{TRUE} windowSize</span><span style="color: #daa520;">1</span><span style="color: #00bfff;"> must be specified.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param maskGrowing logical. Applies simple region-growing (rectangular buffering) to the cloud mask. If \code{TRUE} windowSize</span><span style="color: #daa520;">2</span><span style="color: #00bfff;"> must be specified.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param lowBand bandname or number for the blue band</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param tirBand bandname or number for the thermal band</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param plot logical. Provides plots of the cloud mask for all sub-steps (sanitizing etc.) Helpful to find proper parametrization.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param verbose logical. Print messages or supress.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param returnDiffLayer logical. If \code{TRUE}, the difference layer will be returned along with the cloudmask. This option allows to re-use the difference layer in cloudMask.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@note Typically clouds are cold in the thermal region and have high reflectance in short wavelengths (blue). By differencing the two bands and thresholding a rough cloud mask can be obtained.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">More sophisticated approaches can be found elsewhere, e.g. \link[https://code.google.com/p/fmask/]{fmask}.</span>
<span style="color: #00bfff;"># </span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">It can make sense to find a suitable threshold on a cropped version of the scene. Also make sure you make use of the \code{returnDiffLayer} argument to save yourself one processing step.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">Sanitizing and region growing can be seen as final polishing, i.e. as long as the pure cloud centers are not detected properly, you can turn those two arguments off if they take too long to calculate.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">Once your mask detects obvious cloud pixels properly re-enable sanitizing and regionGrowing for fine tuning if desired. Finally, once a suitable threshold is established re-run cloudMask on the whole scene with this threshold and go get a coffee.</span>
<span style="color: #00bfff;"># </span><span style="color: #ffa500;">@export</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@examples </span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">\dontrun{</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">ls &lt;- stackMeta("path/to/MTL.txt")</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">ls_cor &lt;- radCor(ls, path/to/MTL.txt) </span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">ls_cmask &lt;-cloudMask(ls_cor, returnDiffLayer = TRUE)</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">}</span>
<span style="color: #ff6347;">cloudMask</span> <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>x, threshold, minCloudSize, windowSize<span style="color: #daa520;">1</span> <span style="color: #00ffff;">=</span> <span style="color: #daa520;">5</span>, windowSize<span style="color: #daa520;">2</span> <span style="color: #00ffff;">=</span> <span style="color: #daa520;">11</span>, maskGrowing <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span>, sanitize <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span>, lowBand <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">1</span>, tirBand <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">6</span>, plot <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span>, verbose <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span>, returnDiffLayer <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">){</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Set-up graphics device</span>
        op <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">par</span><span style="color: #20b2aa;">(</span>mfrow <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">2</span>, <span style="color: #daa520;">1</span> <span style="color: #00ffff;">+</span> <span style="color: #ff6347;">sum</span><span style="color: #20b2aa;">(</span>sanitize, maskGrowing<span style="color: #20b2aa;">)))</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Calculate or re-reuse cloud difference layer </span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>CDIFF <span style="color: #00ffff;">%</span><span style="color: #ff00ff;">in</span><span style="color: #00ffff;">%</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>verbose<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span>Re<span style="color: #00ffff;">-</span>using CDIFF layer from previous run.<span style="color: #20b2aa;">)</span>
                cdiff <span style="color: #00ffff;">&lt;-</span> x<span style="color: #20b2aa;">[[</span>CDIFF<span style="color: #20b2aa;">]]</span>
        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                cdiff <span style="color: #00ffff;">&lt;-</span> x<span style="color: #20b2aa;">[[</span>lowBand<span style="color: #20b2aa;">]]</span> <span style="color: #00ffff;">-</span> x<span style="color: #20b2aa;">[[</span>tirBand<span style="color: #20b2aa;">]]</span>
                <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>cdiff<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&lt;-</span> CDIFF
        <span style="color: #20b2aa;">}</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Guess threshold</span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>threshold<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                threshold <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">quantile</span><span style="color: #20b2aa;">(</span>cdiff@data@max:cdiff@data@min, <span style="color: #daa520;">0</span>.<span style="color: #daa520;">45</span><span style="color: #20b2aa;">)</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>verbose<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span><span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>Estimated cloud threshold should be between , <span style="color: #ff6347;">round</span><span style="color: #20b2aa;">(</span>cdiff@data@min<span style="color: #20b2aa;">)</span>,  and , <span style="color: #ff6347;">round</span><span style="color: #20b2aa;">(</span>cdiff@data@max<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">)</span>
                        <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>Guessed <span style="color: #ff6347;">threshold</span> <span style="color: #20b2aa;">(</span>rounded<span style="color: #20b2aa;">)</span>: , <span style="color: #ff6347;">round</span><span style="color: #20b2aa;">(</span>threshold<span style="color: #20b2aa;">)))</span>
                <span style="color: #20b2aa;">}</span>
        <span style="color: #20b2aa;">}</span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>threshold <span style="color: #00ffff;">&lt;</span> cdiff@data@min | threshold <span style="color: #00ffff;">&gt;</span> cdiff@data@max<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">warning</span><span style="color: #20b2aa;">(</span>Threshold is not within the estimated data range, call. <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>plot<span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">plot</span><span style="color: #20b2aa;">(</span>cdiff, main <span style="color: #00ffff;">=</span> Cloud layer: blue <span style="color: #00ffff;">-</span> tir difference<span style="color: #20b2aa;">)</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Thresholding</span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>verbose<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span>Begin thresholding<span style="color: #20b2aa;">)</span>
        cmask <span style="color: #00ffff;">&lt;-</span> cdiff <span style="color: #00ffff;">&gt;</span> threshold
        cmask <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">mask</span><span style="color: #20b2aa;">(</span>cmask, cmask, maskvalue <span style="color: #00ffff;">=</span> <span style="color: #daa520;">0</span><span style="color: #20b2aa;">)</span>

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>plot<span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">plot</span><span style="color: #20b2aa;">(</span>cmask, main <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>Cloud mask\nThreshold: , threshold<span style="color: #20b2aa;">))</span>


        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Remove clouds smaller than minCloudSize</span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>sanitize<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>verbose<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span>Begin sanitzing<span style="color: #20b2aa;">)</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>minCloudSize<span style="color: #20b2aa;">))</span> minCloudSize <span style="color: #00ffff;">&lt;-</span> windowSize<span style="color: #daa520;">1</span> ^ <span style="color: #daa520;">2</span>
                w <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">matrix</span><span style="color: #20b2aa;">(</span>ncol <span style="color: #00ffff;">=</span> windowSize<span style="color: #daa520;">1</span>, nrow <span style="color: #00ffff;">=</span> windowSize<span style="color: #daa520;">1</span>, <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>minCloudSize <span style="color: #00ffff;">&gt;=</span> windowSize^<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                        cmod <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">focal</span><span style="color: #20b2aa;">(</span>cmask, w, na.rm <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>
                <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                        cmod <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">focal</span><span style="color: #20b2aa;">(</span>cmask, w, na.rm <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">)</span>   
                        cmod<span style="color: #20b2aa;">[</span>cmod <span style="color: #00ffff;">&lt;</span> minCloudSize<span style="color: #20b2aa;">]</span> <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">NA</span>         
                <span style="color: #20b2aa;">}</span>
                cmod<span style="color: #20b2aa;">[</span>cmod <span style="color: #00ffff;">&lt;</span> minCloudSize<span style="color: #20b2aa;">]</span> <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">NA</span>
                cmod<span style="color: #20b2aa;">[</span>!<span style="color: #ff6347;">is.na</span><span style="color: #20b2aa;">(</span>cmod<span style="color: #20b2aa;">)]</span> <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">1</span>L
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>plot<span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">plot</span><span style="color: #20b2aa;">(</span>cmod, main <span style="color: #00ffff;">=</span> Sanitized cloud mask<span style="color: #20b2aa;">)</span>

        <span style="color: #20b2aa;">}</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Buffer cloud centers (we could also do a circular buffer, but for now this should suffice)</span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>maskGrowing<span style="color: #20b2aa;">){</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>verbose<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span>Begin region<span style="color: #00ffff;">-</span>growing<span style="color: #20b2aa;">)</span>
                w <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">matrix</span><span style="color: #20b2aa;">(</span>ncol <span style="color: #00ffff;">=</span> windowSize<span style="color: #daa520;">2</span>, nrow <span style="color: #00ffff;">=</span> windowSize<span style="color: #daa520;">2</span>, <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>
                cmod <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">focal</span><span style="color: #20b2aa;">(</span>cmod, w, na.rm <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span> <span style="color: #20b2aa;">)</span>
                cmod<span style="color: #20b2aa;">[</span>!<span style="color: #ff6347;">is.na</span><span style="color: #20b2aa;">(</span>cmod<span style="color: #20b2aa;">)]</span> <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">1</span>L
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>plot<span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">plot</span><span style="color: #20b2aa;">(</span>cmod, main <span style="color: #00ffff;">=</span> Region<span style="color: #00ffff;">-</span>grown cloud mask<span style="color: #20b2aa;">)</span>

        <span style="color: #20b2aa;">}</span>

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>plot<span style="color: #20b2aa;">){</span>
                <span style="color: #ff6347;">plotRGB</span><span style="color: #20b2aa;">(</span>x, <span style="color: #daa520;">1</span>, <span style="color: #daa520;">2</span>, <span style="color: #daa520;">3</span>, title <span style="color: #00ffff;">=</span> Final mask, stretch <span style="color: #00ffff;">=</span> lin<span style="color: #20b2aa;">)</span>
                <span style="color: #ff6347;">plot</span><span style="color: #20b2aa;">(</span>cmod,  legend <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span>, add <span style="color: #00ffff;">=</span> <span style="color: #daa520;">T</span>, col <span style="color: #00ffff;">=</span> yellow<span style="color: #20b2aa;">)</span>
        <span style="color: #20b2aa;">}</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Reset par</span>
        <span style="color: #ff6347;">par</span><span style="color: #20b2aa;">(</span>op<span style="color: #20b2aa;">)</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Return</span>
        <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>cmod<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&lt;-</span> CMASK
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>returnDiffLayer<span style="color: #20b2aa;">)</span> cmod <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">stack</span><span style="color: #20b2aa;">(</span>cmod, cdiff<span style="color: #20b2aa;">)</span>
        <span style="color: #ff00ff;">return</span><span style="color: #20b2aa;">(</span>cmod<span style="color: #20b2aa;">)</span>    
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
