html/RStoolbox_0.01_(2014-5-6_by_).html
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> estimateSHV.R</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param plot display histograms and haze values</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param returnTables return the frequency table per layer. Only takes effect if x is a Raster* object. If x is a result of estimateSHV tables will always be returned.</span>
<span style="color: #00bfff;"># </span><span style="color: #ffa500;">@export</span><span style="color: #00bfff;"> </span>
<span style="color: #ff6347;">estimateSHV</span> <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>x, hazeBand, darkProp <span style="color: #00ffff;">=</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">02</span>, plot <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span>, returnTables <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Initial or repeated run?</span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">inherits</span><span style="color: #20b2aa;">(</span>x, <span style="color: #00ff00;">"Raster"</span><span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                preCalc <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">FALSE</span>
        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.list</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span> &amp; <span style="color: #00ff00;">"table"</span> <span style="color: #00ffff;">%</span><span style="color: #ff00ff;">in</span><span style="color: #00ffff;">%</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                        preCalc <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">TRUE</span> 
                <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                        <span style="color: #ff00ff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"x must be a Raster* object or the result of a previous run of estimateSHV(Raster*, ) with argument returnTables = TRUE"</span>, call. <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>
                <span style="color: #20b2aa;">}</span>       
        <span style="color: #20b2aa;">}</span>

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>!preCalc<span style="color: #20b2aa;">){</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>hazeBand<span style="color: #20b2aa;">)){</span> 
                        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">nlayers</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">==</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                                hazeBand <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span>        
                        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                                <span style="color: #ff00ff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"Please specify the band from which you want to estimate the haze dn"</span><span style="color: #20b2aa;">)</span>
                        <span style="color: #20b2aa;">}</span>       
                        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.numeric</span><span style="color: #20b2aa;">(</span>hazeBand<span style="color: #20b2aa;">))</span> hazeBand <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)[</span>hazeBand<span style="color: #20b2aa;">]</span>
                <span style="color: #20b2aa;">}</span>

        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>

                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.numeric</span><span style="color: #20b2aa;">(</span>hazeBand<span style="color: #20b2aa;">))</span> hazeBand <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x$table<span style="color: #20b2aa;">)[</span>hazeBand<span style="color: #20b2aa;">]</span>
                preCalcAvail <span style="color: #00ffff;">&lt;-</span> hazeBand <span style="color: #00ffff;">%</span><span style="color: #ff00ff;">in</span><span style="color: #00ffff;">%</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x$table<span style="color: #20b2aa;">)</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>!<span style="color: #ff6347;">any</span><span style="color: #20b2aa;">(</span>preCalcAvail<span style="color: #20b2aa;">))</span>  <span style="color: #ff00ff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"Cannot estimate SHV because tables are missing for all specified bands"</span>, call. <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>

                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">any</span><span style="color: #20b2aa;">(</span>!preCalcAvail<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                        <span style="color: #ff00ff;">warning</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"Cannot estimate SHV for &gt;&gt; "</span>, hazeBand<span style="color: #20b2aa;">[</span>!preCalcAvail<span style="color: #20b2aa;">]</span>, <span style="color: #00ff00;">" &lt;&lt; because tables are missing."</span><span style="color: #20b2aa;">)</span>, call. <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>
                        hazeBand <span style="color: #00ffff;">&lt;-</span> hazeBand<span style="color: #20b2aa;">[</span>preCalcAvail<span style="color: #20b2aa;">]</span>                              
                <span style="color: #20b2aa;">}</span>       
        <span style="color: #20b2aa;">}</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Decide whether we open multiple devices</span>
        multiple <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">length</span><span style="color: #20b2aa;">(</span>hazeBand<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&gt;</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> <span style="color: #daa520;">TRUE</span> <span style="color: #ff00ff;">else</span> <span style="color: #daa520;">FALSE</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Run estimation for each band separately</span>
        out   <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">lapply</span><span style="color: #20b2aa;">(</span>hazeBand, <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>bi<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">inherits</span><span style="color: #20b2aa;">(</span>x, <span style="color: #00ff00;">"Raster"</span><span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                                        tf <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">freq</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">[[</span>bi<span style="color: #20b2aa;">]]</span>, useNA <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"no"</span><span style="color: #20b2aa;">)</span> 
                                <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                                        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.list</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span> &amp; <span style="color: #00ff00;">"table"</span> <span style="color: #00ffff;">%</span><span style="color: #ff00ff;">in</span><span style="color: #00ffff;">%</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                                                preCalc <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">TRUE</span>
                                                tf <span style="color: #00ffff;">&lt;-</span> x$table<span style="color: #20b2aa;">[[</span>bi<span style="color: #20b2aa;">]]</span>
                                        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                                                <span style="color: #ff00ff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"x must be a Raster* object or the result of a previous run of estimateSHV() with argument returnTables = TRUE"</span>, call. <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>
                                        <span style="color: #20b2aa;">}</span>
                                <span style="color: #20b2aa;">}</span>
                                tf <span style="color: #00ffff;">&lt;-</span> tf<span style="color: #20b2aa;">[</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span> <span style="color: #00ffff;">&gt;</span> <span style="color: #daa520;">0</span>,<span style="color: #20b2aa;">]</span>
                                tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">2</span><span style="color: #20b2aa;">]</span> <span style="color: #00ffff;">&lt;-</span> tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">2</span><span style="color: #20b2aa;">]</span><span style="color: #00ffff;">/</span><span style="color: #ff6347;">sum</span><span style="color: #20b2aa;">(</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">2</span><span style="color: #20b2aa;">])</span>
                                dtf <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">diff</span><span style="color: #20b2aa;">(</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">2</span><span style="color: #20b2aa;">])</span>,<span style="color: #daa520;">0</span><span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">/</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">diff</span><span style="color: #20b2aa;">(</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">])</span>,<span style="color: #daa520;">0</span><span style="color: #20b2aa;">)</span>

                                SHV <span style="color: #00ffff;">&lt;-</span> tf<span style="color: #20b2aa;">[</span><span style="color: #ff6347;">which</span><span style="color: #20b2aa;">(</span>dtf <span style="color: #00ffff;">&gt;</span> darkProp<span style="color: #20b2aa;">)[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span>, <span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span> 
                                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.na</span><span style="color: #20b2aa;">(</span>SHV<span style="color: #20b2aa;">))</span> <span style="color: #ff00ff;">warning</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"darkProp for band"</span>, bi, <span style="color: #00ff00;">"was chosen too high. It exceeds the value range."</span><span style="color: #20b2aa;">)</span>, call. <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>

                                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>plot<span style="color: #20b2aa;">){</span>
                                        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>multiple<span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">x</span><span style="color: #daa520;">11</span><span style="color: #20b2aa;">()</span>
                                        <span style="color: #ff6347;">par</span><span style="color: #20b2aa;">(</span>mfrow <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">1</span>,<span style="color: #daa520;">2</span><span style="color: #20b2aa;">))</span>

                                        <span style="color: #ff6347;">plot</span><span style="color: #20b2aa;">(</span>tf, xlab <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"DN"</span>, ylab <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"Frequency"</span>, type <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"l"</span>, main <span style="color: #00ffff;">=</span> bi<span style="color: #20b2aa;">)</span>
                                        <span style="color: #ff6347;">abline</span><span style="color: #20b2aa;">(</span>v <span style="color: #00ffff;">=</span> tf<span style="color: #20b2aa;">[</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span><span style="color: #00ffff;">==</span>SHV,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span>, col<span style="color: #00ffff;">=</span><span style="color: #00ff00;">"red"</span><span style="color: #20b2aa;">)</span>
                                        <span style="color: #ff6347;">text</span><span style="color: #20b2aa;">(</span>SHV, <span style="color: #ff6347;">max</span><span style="color: #20b2aa;">(</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">2</span><span style="color: #20b2aa;">])</span>, pos<span style="color: #00ffff;">=</span><span style="color: #daa520;">4</span>, label <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"SHV_DN = "</span>, SHV<span style="color: #20b2aa;">)</span>, col <span style="color: #00ffff;">=</span><span style="color: #00ff00;">"red"</span><span style="color: #20b2aa;">)</span>

                                        <span style="color: #ff6347;">plot</span><span style="color: #20b2aa;">(</span>dtf, type<span style="color: #00ffff;">=</span><span style="color: #00ff00;">"l"</span>, xlab <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"DN"</span>, ylab <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"diff(Frequency)"</span>, main <span style="color: #00ffff;">=</span> bi<span style="color: #20b2aa;">)</span>
                                        <span style="color: #ff6347;">abline</span><span style="color: #20b2aa;">(</span>v <span style="color: #00ffff;">=</span> tf<span style="color: #20b2aa;">[</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span><span style="color: #00ffff;">==</span>SHV,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span>, col<span style="color: #00ffff;">=</span><span style="color: #00ff00;">"red"</span><span style="color: #20b2aa;">)</span>
                                        <span style="color: #ff6347;">abline</span><span style="color: #20b2aa;">(</span>h <span style="color: #00ffff;">=</span> darkProp, col <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"#</span><span style="color: #daa520;">00000070</span><span style="color: #00ff00;">"</span>, lty <span style="color: #00ffff;">=</span> <span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span>
                                        <span style="color: #ff6347;">text</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">max</span><span style="color: #20b2aa;">(</span>tf<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">])</span>, darkProp, label <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"darkProp = "</span>, darkProp<span style="color: #20b2aa;">)</span>, col <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"#</span><span style="color: #daa520;">00000070</span><span style="color: #00ff00;">"</span><span style="color: #20b2aa;">)</span>
                                        <span style="color: #ff6347;">text</span><span style="color: #20b2aa;">(</span>SHV, <span style="color: #ff6347;">max</span><span style="color: #20b2aa;">(</span>dtf, na.rm <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">)</span>, pos<span style="color: #00ffff;">=</span><span style="color: #daa520;">4</span>, label <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"SHV_DN = "</span>, SHV<span style="color: #20b2aa;">)</span>, col <span style="color: #00ffff;">=</span><span style="color: #00ff00;">"red"</span><span style="color: #20b2aa;">)</span>

                                <span style="color: #20b2aa;">}</span>

                                <span style="color: #ff00ff;">return</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>table <span style="color: #00ffff;">=</span> tf, SHV <span style="color: #00ffff;">=</span> SHV<span style="color: #20b2aa;">))</span>
                        <span style="color: #20b2aa;">})</span>

        SHV <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">unlist</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span>out, <span style="color: #00ff00;">"["</span>, <span style="color: #daa520;">2</span><span style="color: #20b2aa;">))</span>
        <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>SHV<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&lt;-</span> hazeBand

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>!preCalc<span style="color: #20b2aa;">){</span>
                table <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span>out, <span style="color: #00ff00;">"["</span>, <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>
                <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>table<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&lt;-</span> hazeBand
        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                table <span style="color: #00ffff;">&lt;-</span> x$table
        <span style="color: #20b2aa;">}</span>
        <span style="color: #ff00ff;">return</span><span style="color: #20b2aa;">(</span> <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>!returnTables<span style="color: #20b2aa;">)</span> SHV <span style="color: #ff00ff;">else</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>SHV<span style="color: #00ffff;">=</span>SHV, table <span style="color: #00ffff;">=</span> table<span style="color: #20b2aa;">))</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
