html/RStoolbox_0.01_(2014-5-6_by_).html
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> radCor.R</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param x raster object</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param metaData either the result of \code{readMeta} or a path to the meta data (MCL) file. </span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param reflectance logical. If \code{TRUE} output will be reflectance, if \code{FALSE} it will be radiance</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param thermal logical. If \code{TRUE} thermal bands will be converted to brightness temperature (Kelvin).</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param bandSet numeric or character. original Landsat band numbers or names in the form of ("B</span><span style="color: #daa520;">1</span><span style="color: #00bfff;">", "B</span><span style="color: #daa520;">2</span><span style="color: #00bfff;">" etc). If set to full all bands in the solar region will be processed.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param gain Band-specific sensor gain. Require either gain and offset or Grescale and Brescale to convert DN to radiance.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param offset Band-specific sensor offset. Require either gain and offset or Grescale and Brescale to convert DN to radiance.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param Grescale Band-specific sensor Grescale (gain). Require either gain and offset or Grescale and Brescale to convert DN to radiance.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param Brescale Band-specific sensor Brescale (bias). Require either gain and offset or Grescale and Brescale to convert DN to radiance.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param sunElev Sun elevation in degrees</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param satZenith sensor zenith angle (</span><span style="color: #daa520;">0</span><span style="color: #00bfff;"> for Landsat)</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param d Earth-Sun distance in AU.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param esun Mean exo-atmospheric solar irradiance, as given by Chandler et al. </span><span style="color: #daa520;">2009</span><span style="color: #00bfff;"> or others.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param SHV starting haze value, can be estimated using estimateSHV(). if not provided and method is DOS or COSTZ SHV will be estimated in an automated fashion. Not needed for apparent reflectance.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param hazeBand band from which SHV was estimated.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param method Radiometric correction method to be used. There are currently four methods available (see Details):</span>
<span style="color: #00bfff;">#  </span><span style="color: #00bfff;">"APREF", "DOS" (Chavez </span><span style="color: #daa520;">1989</span><span style="color: #00bfff;">), "COSTZ" (Chavez </span><span style="color: #daa520;">1996</span><span style="color: #00bfff;">), SDOS.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@note This was originally a fork of randcorr in the landsat package. It may be slower, however it works on Raster* objects and hence is memory-safe.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@details  \describe{</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">\item{APREF}{Apparent reflectance}</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">\item{DOS}{Dark object subtratction following Chavez (</span><span style="color: #daa520;">1989</span><span style="color: #00bfff;">)}</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">\item{COSTZ}{Dark object subtraction following Chaves(</span><span style="color: #daa520;">1996</span><span style="color: #00bfff;">)}</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">\item{SDOS}{Simple dark object subtraction. Classical DOS, Lhaze must be estimated for each band separately.}</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">}</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@references S. Goslee (</span><span style="color: #daa520;">2011</span><span style="color: #00bfff;">): Analyzing Remote Sensing Data in R: The landsat Package. Journal of Statistical Software </span><span style="color: #daa520;">43</span><span style="color: #00bfff;">(</span><span style="color: #daa520;">4</span><span style="color: #00bfff;">).</span>
<span style="color: #00bfff;"># </span><span style="color: #ffa500;">@export</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@seealso \link[landsat]{radiocorr} </span>
<span style="color: #ff6347;">radCor</span> <span style="color: #00ffff;">&lt;-</span>       <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>x, metaData, reflectance <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span>, thermal <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span>, satellite, bandSet <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"full"</span>, gain, offset, G_rescale, B_rescale,
                sunElev, satZenith <span style="color: #00ffff;">=</span> <span style="color: #daa520;">0</span>, d, esun, date, SHV, hazeBand, atHaze,  method <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"APREF"</span><span style="color: #20b2aa;">){</span>
        <span style="color: #00bfff;"># </span><span style="color: #00bfff;">http://landsat.usgs.gov/Landsat</span><span style="color: #daa520;">8</span><span style="color: #00bfff;">_Using_Product.php</span>

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>!method <span style="color: #00ffff;">%</span><span style="color: #ff00ff;">in</span><span style="color: #00ffff;">%</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"APREF"</span>, <span style="color: #00ff00;">"DOS"</span>, <span style="color: #00ff00;">"COSTZ"</span>, <span style="color: #00ff00;">"SDOS"</span><span style="color: #20b2aa;">))</span> <span style="color: #ff00ff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"method must be one of APREF, DOS, COSTZ SDOS"</span>, call.<span style="color: #00ffff;">=</span><span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>!reflectance &amp; method !<span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"APREF"</span><span style="color: #20b2aa;">){</span>
                <span style="color: #ff00ff;">warning</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"For radiance calculations the method argument is ignored"</span><span style="color: #20b2aa;">)</span>
                method <span style="color: #00ffff;">&lt;-</span> <span style="color: #00ff00;">"APREF"</span>
        <span style="color: #20b2aa;">}</span>

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>!<span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>metaData<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>

                <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Read metadata from file</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.character</span><span style="color: #20b2aa;">(</span>metaData<span style="color: #20b2aa;">))</span> metaData <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">readMeta</span><span style="color: #20b2aa;">(</span>metaData<span style="color: #20b2aa;">)</span>

                satellite       <span style="color: #00ffff;">&lt;-</span> metaData$UNIFIED_METADATA$SPACECRAFT_ID
                sensor          <span style="color: #00ffff;">&lt;-</span> metaData$UNIFIED_METADATA$SENSOR_ID
                B_rescale       <span style="color: #00ffff;">&lt;-</span> metaData$UNIFIED_METADATA$RAD_OFFSET
                G_rescale       <span style="color: #00ffff;">&lt;-</span> metaData$UNIFIED_METADATA$RAD_GAIN
                d                       <span style="color: #00ffff;">&lt;-</span> metaData$UNIFIED_METADATA$EARTH_SUN_DISTANCE
                sunElev         <span style="color: #00ffff;">&lt;-</span> metaData$UNIFIED_METADATA$SUN_ELEVATION
                rad             <span style="color: #00ffff;">&lt;-</span> metaData$UNIFIED_METADATA$RADIOMETRIC_RES
                K<span style="color: #daa520;">1</span>                      <span style="color: #00ffff;">&lt;-</span> metaData$UNIFIED_METADATA$K<span style="color: #daa520;">1</span>
                K<span style="color: #daa520;">2</span>                      <span style="color: #00ffff;">&lt;-</span> metaData$UNIFIED_METADATA$K<span style="color: #daa520;">2</span>

        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #00bfff;">###  </span><span style="color: #00bfff;">FIXME: HARD CODED !!</span>
                sensor <span style="color: #00ffff;">=</span> <span style="color: #daa520;">1</span>
                rad <span style="color: #00ffff;">=</span> <span style="color: #daa520;">8</span>
                <span style="color: #00bfff;">###</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>G_rescale<span style="color: #20b2aa;">)</span> | <span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>B_rescale<span style="color: #20b2aa;">)){</span>
                        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>offset<span style="color: #20b2aa;">)</span> | <span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>gain<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                                <span style="color: #ff00ff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"Please specify either a) metaData, b) gain and offset, c) B_rescale and G_rescale"</span>, call. <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span> <span style="color: #20b2aa;">)</span>
                        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                                B_rescale <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">1</span><span style="color: #00ffff;">/</span>gain
                                G_rescale <span style="color: #00ffff;">&lt;-</span> <span style="color: #00ffff;">-</span>offset<span style="color: #00ffff;">/</span>gain
                        <span style="color: #20b2aa;">}</span>
                <span style="color: #20b2aa;">}</span>


                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>d<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>date<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span> 
                                <span style="color: #ff00ff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"Please specify either a) edist or b)date"</span>, call. <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span> 
                        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                                d <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">.ESdist</span><span style="color: #20b2aa;">(</span>date<span style="color: #20b2aa;">)</span> 
                        <span style="color: #20b2aa;">}</span>
                <span style="color: #20b2aa;">}</span>
        <span style="color: #20b2aa;">}</span>

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>satellite <span style="color: #00ffff;">==</span> <span style="color: #00ff00;">"LANDSAT</span><span style="color: #daa520;">8</span><span style="color: #00ff00;">"</span> &amp; method !<span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"APREF"</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #ff00ff;">warning</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"DOS, COSTZ and SDOS are currently not implemented for Landsat </span><span style="color: #daa520;">8</span><span style="color: #00ff00;">. Using official reflectance calibration coefficients, i.e. output corresponds to method = APREF"</span>, call. <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span> 
                method <span style="color: #00ffff;">&lt;-</span> <span style="color: #00ff00;">"APREF"</span>
        <span style="color: #20b2aa;">}</span>

        satZenith       <span style="color: #00ffff;">&lt;-</span> satZenith * pi <span style="color: #00ffff;">/</span> <span style="color: #daa520;">180</span>
        satphi          <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">cos</span><span style="color: #20b2aa;">(</span>satZenith<span style="color: #20b2aa;">)</span>
        suntheta        <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">cos</span><span style="color: #20b2aa;">((</span><span style="color: #daa520;">90</span> <span style="color: #00ffff;">-</span> sunElev<span style="color: #20b2aa;">)</span> * pi <span style="color: #00ffff;">/</span> <span style="color: #daa520;">180</span><span style="color: #20b2aa;">)</span>       

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Query internal db    </span>
        sDB <span style="color: #00ffff;">&lt;-</span> LANDSAT.db<span style="color: #20b2aa;">[[</span>satellite<span style="color: #20b2aa;">]][[</span>sensor<span style="color: #20b2aa;">]]</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">We use .getNumeric to deal with band name appendices (e.g. LS</span><span style="color: #daa520;">7</span><span style="color: #00bfff;"> can have to versions of band </span><span style="color: #daa520;">6</span><span style="color: #00bfff;">: B</span><span style="color: #daa520;">6</span><span style="color: #00bfff;">_VCID_</span><span style="color: #daa520;">1</span><span style="color: #00bfff;"> and B</span><span style="color: #daa520;">6</span><span style="color: #00bfff;">_VCID_</span><span style="color: #daa520;">2</span>
        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">which would not match the database name B</span><span style="color: #daa520;">6</span>
        sDB     <span style="color: #00ffff;">&lt;-</span> sDB<span style="color: #20b2aa;">[</span><span style="color: #ff6347;">match</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"B"</span>, <span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">.getNumeric</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">))</span>,<span style="color: #00ff00;">"["</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">))</span>, sDB$band<span style="color: #20b2aa;">)</span>,<span style="color: #20b2aa;">]</span>      
        sDB             <span style="color: #00ffff;">&lt;-</span> sDB<span style="color: #20b2aa;">[</span><span style="color: #ff6347;">match</span><span style="color: #20b2aa;">(</span>sDB$band, <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"B"</span>,<span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">.getNumeric</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">))</span>,<span style="color: #00ff00;">"["</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">)))</span>,<span style="color: #20b2aa;">]</span>

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">any</span><span style="color: #20b2aa;">(</span>bandSet <span style="color: #00ffff;">==</span> <span style="color: #00ff00;">"full"</span><span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                bandSet <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span>
        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.numeric</span><span style="color: #20b2aa;">(</span>bandSet<span style="color: #20b2aa;">))</span> bandSet <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"B"</span>, bandSet<span style="color: #20b2aa;">)</span>
        <span style="color: #20b2aa;">}</span>       

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>metaData<span style="color: #20b2aa;">))</span>   <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>B_rescale<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>G_rescale<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&lt;-</span> bandSet

        origBands       <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span>   
        corBands        <span style="color: #00ffff;">&lt;-</span> sDB<span style="color: #20b2aa;">[</span>!sDB$bandtype <span style="color: #00ffff;">%</span><span style="color: #ff00ff;">in</span><span style="color: #00ffff;">%</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"TIR"</span>, <span style="color: #00ff00;">"PAN"</span><span style="color: #20b2aa;">)</span>, <span style="color: #00ff00;">"band"</span><span style="color: #20b2aa;">]</span>
        bandSet         <span style="color: #00ffff;">&lt;-</span> bandSet<span style="color: #20b2aa;">[</span>bandSet <span style="color: #00ffff;">%</span><span style="color: #ff00ff;">in</span><span style="color: #00ffff;">%</span> corBands<span style="color: #20b2aa;">]</span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>thermal<span style="color: #20b2aa;">){</span>
                tirBands        <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>satellite<span style="color: #00ffff;">==</span><span style="color: #00ff00;">"LANDSAT</span><span style="color: #daa520;">8</span><span style="color: #00ff00;">"</span><span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"B</span><span style="color: #daa520;">10</span><span style="color: #00ff00;">"</span>, <span style="color: #00ff00;">"B</span><span style="color: #daa520;">11</span><span style="color: #00ff00;">"</span><span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">else</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"B</span><span style="color: #daa520;">6</span><span style="color: #00ff00;">"</span>, <span style="color: #00ff00;">"B</span><span style="color: #daa520;">6</span><span style="color: #00ff00;">_VCID_</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">"</span>, <span style="color: #00ff00;">"B</span><span style="color: #daa520;">6</span><span style="color: #00ff00;">_VCID_</span><span style="color: #daa520;">2</span><span style="color: #00ff00;">"</span><span style="color: #20b2aa;">)</span>     
                tirBands        <span style="color: #00ffff;">&lt;-</span> origBands<span style="color: #20b2aa;">[</span>origBands <span style="color: #00ffff;">%</span><span style="color: #ff00ff;">in</span><span style="color: #00ffff;">%</span> tirBands<span style="color: #20b2aa;">]</span>
        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                tirBands <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">NULL</span>
        <span style="color: #20b2aa;">}</span>
        exclBands       <span style="color: #00ffff;">&lt;-</span> origBands<span style="color: #20b2aa;">[</span>!origBands <span style="color: #00ffff;">%</span><span style="color: #ff00ff;">in</span><span style="color: #00ffff;">%</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>bandSet, tirBands<span style="color: #20b2aa;">)]</span>

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">length</span><span style="color: #20b2aa;">(</span>exclBands<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&gt;</span> <span style="color: #daa520;">0</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                xexc <span style="color: #00ffff;">&lt;-</span> x<span style="color: #20b2aa;">[[</span>exclBands<span style="color: #20b2aa;">]]</span> 
        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                xexc <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">NULL</span>
        <span style="color: #20b2aa;">}</span>

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>esun<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                esun <span style="color: #00ffff;">&lt;-</span> sDB<span style="color: #20b2aa;">[</span>,<span style="color: #00ff00;">"esun"</span><span style="color: #20b2aa;">]</span> 
                <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>esun<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&lt;-</span> sDB$band
        <span style="color: #20b2aa;">}</span>
        xref <span style="color: #00ffff;">&lt;-</span> x<span style="color: #20b2aa;">[[</span>bandSet<span style="color: #20b2aa;">]]</span>

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>reflectance<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"Bands to convert to reflectance: "</span>, <span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span>bandSet, collapse <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">", "</span><span style="color: #20b2aa;">))</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">length</span><span style="color: #20b2aa;">(</span>tirBands<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&gt;</span> <span style="color: #daa520;">0</span> &amp; thermal<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"Thermal bands to convert to brightness temperatures: "</span>, <span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span>tirBands, collapse<span style="color: #00ffff;">=</span><span style="color: #00ff00;">", "</span><span style="color: #20b2aa;">))</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">length</span><span style="color: #20b2aa;">(</span>exclBands<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&gt;</span> <span style="color: #daa520;">0</span><span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"Excluding bands: "</span>, <span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span>exclBands, collapse <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">", "</span><span style="color: #20b2aa;">))</span>       
        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                bandSet <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>bandSet, tirBands<span style="color: #20b2aa;">)</span>
                <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"Bands to convert to toa radiance: "</span>, <span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span>bandSet, collapse <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">", "</span><span style="color: #20b2aa;">))</span>
        <span style="color: #20b2aa;">}</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Thermal processing</span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>thermal &amp; reflectance &amp; <span style="color: #ff6347;">length</span><span style="color: #20b2aa;">(</span>tirBands<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&gt;</span> <span style="color: #daa520;">0</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"Processing thermal band(s)"</span><span style="color: #20b2aa;">)</span>
                <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Convert to radiance</span>
                L <span style="color: #00ffff;">&lt;-</span> G_rescale<span style="color: #20b2aa;">[</span>tirBands<span style="color: #20b2aa;">]</span> * x<span style="color: #20b2aa;">[[</span>tirBands<span style="color: #20b2aa;">]]</span> <span style="color: #00ffff;">+</span> B_rescale<span style="color: #20b2aa;">[</span>tirBands<span style="color: #20b2aa;">]</span>
                <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Convert to temperature</span>
                xtir <span style="color: #00ffff;">&lt;-</span> K<span style="color: #daa520;">2</span> <span style="color: #00ffff;">/</span> <span style="color: #ff6347;">log</span><span style="color: #20b2aa;">(</span>K<span style="color: #daa520;">1</span><span style="color: #00ffff;">/</span>L <span style="color: #00ffff;">+</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> 
                <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>xtir<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&lt;-</span> tirBands
        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                xtir <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">NULL</span>
        <span style="color: #20b2aa;">}</span>

        <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"Processing radiance / reflectance"</span><span style="color: #20b2aa;">)</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Radiance and reflectance processing</span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>method <span style="color: #00ffff;">==</span> <span style="color: #00ff00;">"APREF"</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                TAUz <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">1</span>
                TAUv <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">1</span>
                Edown <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">0</span>
                Lhaze <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">0</span>

        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>

                <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Estimate SHV automatically</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>SHV<span style="color: #20b2aa;">)){</span>
                        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>hazeBand<span style="color: #20b2aa;">))</span>  hazeBand <span style="color: #00ffff;">&lt;-</span> <span style="color: #00ff00;">"B</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">"</span>
                        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">length</span><span style="color: #20b2aa;">(</span>hazeBand<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&gt;</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                                <span style="color: #ff00ff;">warning</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"Automatic search for SHV values is intended for one band only. For more bands please estimate hzae DNs manually using estimateSHV() \nhazeBand was automatically reset to </span><span style="color: #daa520;">1</span><span style="color: #00ff00;">"</span><span style="color: #20b2aa;">)</span>
                                hazeBand <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">1</span> <span style="color: #20b2aa;">}</span>
                        <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"SHV was not provided -&gt; Estimating SHV automatically"</span><span style="color: #20b2aa;">)</span>
                        dP <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">02</span>
                        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">We suppress warnings because we search for a possible value autimatically in case we missed the first time</span>
                        SHV <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">suppressWarnings</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">estimateSHV</span><span style="color: #20b2aa;">(</span>x, hazeBand <span style="color: #00ffff;">=</span> hazeBand, darkProp <span style="color: #00ffff;">=</span> dP , plot <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span>, returnTables <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">))</span>
                        <span style="color: #ff00ff;">while</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.na</span><span style="color: #20b2aa;">(</span>SHV<span style="color: #20b2aa;">[[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]])){</span>
                                dP      <span style="color: #00ffff;">&lt;-</span> dP * <span style="color: #daa520;">0</span>.<span style="color: #daa520;">9</span>
                                SHV <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">suppressWarnings</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">estimateSHV</span><span style="color: #20b2aa;">(</span>SHV, hazeBand <span style="color: #00ffff;">=</span> hazeBand, darkProp <span style="color: #00ffff;">=</span> dP, plot <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span>, returnTables <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">))</span>
                        <span style="color: #20b2aa;">}</span>
                        <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"SHV estimated as: "</span>, SHV<span style="color: #20b2aa;">[[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]]))</span>
                        SHV <span style="color: #00ffff;">&lt;-</span> SHV<span style="color: #20b2aa;">[[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]]</span>
                <span style="color: #20b2aa;">}</span>


                <span style="color: #00bfff;"># </span><span style="color: #00bfff;">For SDOS gain, offset, Lhaze and Esun must be provided as coresponding vectors of equal length</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>method <span style="color: #00ffff;">==</span> <span style="color: #00ff00;">"SDOS"</span><span style="color: #20b2aa;">)</span> hazeBand <span style="color: #00ffff;">&lt;-</span> bandSet 
                TAUz <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">1</span>
                TAUv <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">1</span>
                Edown <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">0</span>                              
                <span style="color: #ff00ff;">if</span> <span style="color: #20b2aa;">(</span>method <span style="color: #00ffff;">==</span> <span style="color: #00ff00;">"COSTZ"</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                        TAUz <span style="color: #00ffff;">&lt;-</span> suntheta
                        TAUv <span style="color: #00ffff;">&lt;-</span> satphi
                <span style="color: #20b2aa;">}</span>  

                <span style="color: #00bfff;">## </span><span style="color: #daa520;">1</span><span style="color: #00bfff;">% correction and conversion to radiance</span>
                Ldo <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">01</span> * <span style="color: #20b2aa;">((</span>esun<span style="color: #20b2aa;">[</span>hazeBand<span style="color: #20b2aa;">]</span> * suntheta * TAUz<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">+</span> Edown<span style="color: #20b2aa;">)</span> * TAUv <span style="color: #00ffff;">/</span> <span style="color: #20b2aa;">(</span>pi * d ^ <span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span>
                Lhaze <span style="color: #00ffff;">&lt;-</span> <span style="color: #20b2aa;">(</span>SHV * G_rescale<span style="color: #20b2aa;">[</span>hazeBand<span style="color: #20b2aa;">]</span> <span style="color: #00ffff;">+</span> B_rescale<span style="color: #20b2aa;">[</span>hazeBand<span style="color: #20b2aa;">])</span> <span style="color: #00ffff;">-</span> Ldo

                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>method <span style="color: #00ffff;">%</span><span style="color: #ff00ff;">in</span><span style="color: #00ffff;">%</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"DOS"</span>, <span style="color: #00ff00;">"COSTZ"</span><span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>             
                        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Pick atmoshpere type</span>
                        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>atHaze<span style="color: #20b2aa;">))</span> <span style="color: #20b2aa;">{</span>
                                atHaze.db <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">data.frame</span><span style="color: #20b2aa;">(</span>min <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">1</span>,<span style="color: #daa520;">56</span>,<span style="color: #daa520;">76</span>,<span style="color: #daa520;">96</span>,<span style="color: #daa520;">116</span><span style="color: #20b2aa;">)</span>, max <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">55</span>,<span style="color: #daa520;">75</span>,<span style="color: #daa520;">95</span>,<span style="color: #daa520;">115</span>,<span style="color: #daa520;">255</span><span style="color: #20b2aa;">))</span> <span style="color: #00ffff;">/</span> <span style="color: #daa520;">255</span> * <span style="color: #20b2aa;">(</span><span style="color: #daa520;">2</span>^rad<span style="color: #00ffff;">-</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>
                                atHaze <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"veryClear"</span>, <span style="color: #00ff00;">"clear"</span>, <span style="color: #00ff00;">"moderate"</span>, <span style="color: #00ff00;">"hazy"</span>, <span style="color: #00ff00;">"veryHazy"</span><span style="color: #20b2aa;">)[</span>Lhaze <span style="color: #00ffff;">&gt;</span> atHaze.db<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">1</span><span style="color: #20b2aa;">]</span> &amp; Lhaze <span style="color: #00ffff;">&lt;=</span> atHaze.db<span style="color: #20b2aa;">[</span>,<span style="color: #daa520;">2</span><span style="color: #20b2aa;">]]</span>
                                <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"Selcting atmosphere: , atHaze, "</span><span style="color: #20b2aa;">)</span>
                        <span style="color: #20b2aa;">}</span>               
                        Lhaze     <span style="color: #00ffff;">&lt;-</span> Lhaze  * sDB<span style="color: #20b2aa;">[</span><span style="color: #ff6347;">match</span><span style="color: #20b2aa;">(</span>bandSet,sDB$band<span style="color: #20b2aa;">)</span>, <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>hazeBand,<span style="color: #00ff00;">"_"</span>, atHaze<span style="color: #20b2aa;">)]</span>

                        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Calculate corrected RAD_haze</span>
                        NORM  <span style="color: #00ffff;">&lt;-</span> G_rescale<span style="color: #20b2aa;">[</span>bandSet<span style="color: #20b2aa;">]</span> <span style="color: #00ffff;">/</span> G_rescale<span style="color: #20b2aa;">[</span>hazeBand<span style="color: #20b2aa;">]</span>
                        Lhaze <span style="color: #00ffff;">&lt;-</span> Lhaze * NORM <span style="color: #00ffff;">+</span> B_rescale<span style="color: #20b2aa;">[</span>bandSet<span style="color: #20b2aa;">]</span>      
                <span style="color: #20b2aa;">}</span>
                <span style="color: #00bfff;"># </span><span style="color: #00bfff;">In case Lhaze becomes negative we reset it to zero to prevent artefacts.</span>
                Lhaze <span style="color: #20b2aa;">[</span>Lhaze <span style="color: #00ffff;">&lt;</span> <span style="color: #daa520;">0</span><span style="color: #20b2aa;">]</span> <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">0</span>
        <span style="color: #20b2aa;">}</span>

        B_rescale       <span style="color: #00ffff;">&lt;-</span> B_rescale<span style="color: #20b2aa;">[</span>bandSet<span style="color: #20b2aa;">]</span>
        G_rescale       <span style="color: #00ffff;">&lt;-</span> G_rescale<span style="color: #20b2aa;">[</span>bandSet<span style="color: #20b2aa;">]</span>
        esun <span style="color: #00ffff;">&lt;-</span> esun<span style="color: #20b2aa;">[</span>bandSet<span style="color: #20b2aa;">]</span>

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>satellite !<span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"LANDSAT</span><span style="color: #daa520;">8</span><span style="color: #00ff00;">"</span><span style="color: #20b2aa;">){</span>

                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>!reflectance<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">TOA Radiance</span>
                        xref <span style="color: #00ffff;">&lt;-</span>  <span style="color: #20b2aa;">(</span> xref * G_rescale <span style="color: #00ffff;">+</span> B_rescale<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">/</span> suntheta
                <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">At-surface reflectance (precalculate coefficients to speed up raster processing)</span>
                        C <span style="color: #00ffff;">&lt;-</span> <span style="color: #20b2aa;">(</span>pi * d ^ <span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span><span style="color: #00ffff;">/</span><span style="color: #20b2aa;">(</span>TAUv * <span style="color: #20b2aa;">(</span>esun * suntheta * TAUz <span style="color: #00ffff;">+</span> Edown<span style="color: #20b2aa;">))</span>     
                        b <span style="color: #00ffff;">&lt;-</span> C * <span style="color: #20b2aa;">(</span>B_rescale <span style="color: #00ffff;">-</span> Lhaze<span style="color: #20b2aa;">)</span>
                        a <span style="color: #00ffff;">&lt;-</span> C * G_rescale 
                        xref <span style="color: #00ffff;">&lt;-</span>  a * xref  <span style="color: #00ffff;">+</span> b
                <span style="color: #20b2aa;">}</span>

        <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>

                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>reflectance<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                        B_rescale               <span style="color: #00ffff;">&lt;-</span> metaData$UNIFIED_METADATA$REF_OFFSET<span style="color: #20b2aa;">[</span>bandSet<span style="color: #20b2aa;">]</span>
                        G_rescale               <span style="color: #00ffff;">&lt;-</span> metaData$UNIFIED_METADATA$REF_GAIN<span style="color: #20b2aa;">[</span>bandSet<span style="color: #20b2aa;">]</span>
                <span style="color: #20b2aa;">}</span> 

                <span style="color: #00bfff;">## </span><span style="color: #00bfff;">At sensor radiance / reflectance</span>
                xref <span style="color: #00ffff;">&lt;-</span>  <span style="color: #20b2aa;">(</span>G_rescale * xref <span style="color: #00ffff;">+</span> B_rescale<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">/</span> suntheta

                <span style="color: #00bfff;">## </span><span style="color: #00bfff;">At-surface reflectance?</span>
        <span style="color: #20b2aa;">}</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Re-combine thermal, solar and excluded imagery</span>
        x <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">stack</span><span style="color: #20b2aa;">(</span>xref,xtir, xexc<span style="color: #20b2aa;">)</span>
        x <span style="color: #00ffff;">&lt;-</span> x<span style="color: #20b2aa;">[[</span>origBands<span style="color: #20b2aa;">]]</span>

        <span style="color: #ff00ff;">return</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">}</span>


<span style="color: #00bfff;"># </span><span style="color: #00bfff;">Landsat auxilliary data. Taken from Chander et al </span><span style="color: #daa520;">2009</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">spatRes resampling: http://landsat.usgs.gov/band_designations_landsat_satellites.php</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@keywords internal</span>
LANDSAT.db <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>
                LANDSAT<span style="color: #daa520;">5</span> <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">list</span> <span style="color: #20b2aa;">(</span>
                                TM <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">data.frame</span><span style="color: #20b2aa;">(</span>band <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>B, <span style="color: #daa520;">1</span>:<span style="color: #daa520;">7</span><span style="color: #20b2aa;">)</span>,
                                                bandtype <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span>REF, <span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>, TIR, REF<span style="color: #20b2aa;">)</span>,
                                                centerWavl <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">0</span>.<span style="color: #daa520;">485</span>, <span style="color: #daa520;">0</span>.<span style="color: #daa520;">569</span>, <span style="color: #daa520;">0</span>.<span style="color: #daa520;">66</span>, <span style="color: #daa520;">0</span>.<span style="color: #daa520;">840</span>, <span style="color: #daa520;">1</span>.<span style="color: #daa520;">676</span>, <span style="color: #daa520;">11</span>.<span style="color: #daa520;">435</span>, <span style="color: #daa520;">2</span>.<span style="color: #daa520;">223</span><span style="color: #20b2aa;">)</span>,
                                                spatRes<span style="color: #daa520;">1</span> <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>, <span style="color: #daa520;">7</span><span style="color: #20b2aa;">)</span>,
                                                spatRes<span style="color: #daa520;">2</span> <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>,<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>, <span style="color: #daa520;">60</span>, <span style="color: #daa520;">30</span><span style="color: #20b2aa;">)</span>, <span style="color: #00bfff;">## </span><span style="color: #00bfff;">TM Band </span><span style="color: #daa520;">6</span><span style="color: #00bfff;"> was acquired at </span><span style="color: #daa520;">120</span><span style="color: #00bfff;">-meter resolution, but products processed before February </span><span style="color: #daa520;">25</span><span style="color: #00bfff;">, </span><span style="color: #daa520;">2010</span><span style="color: #00bfff;"> are resampled to </span><span style="color: #daa520;">60</span><span style="color: #00bfff;">-meter pixels. Products processed after February </span><span style="color: #daa520;">25</span><span style="color: #00bfff;">, </span><span style="color: #daa520;">2010</span><span style="color: #00bfff;"> are resampled to </span><span style="color: #daa520;">30</span><span style="color: #00bfff;">-meter pixels.</span>
                                                esun <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">1983</span>, <span style="color: #daa520;">1796</span>, <span style="color: #daa520;">1536</span>, <span style="color: #daa520;">1031</span>, <span style="color: #daa520;">220</span>, <span style="color: #daa520;">NA</span>, <span style="color: #daa520;">83</span>.<span style="color: #daa520;">44</span><span style="color: #20b2aa;">))</span>
                <span style="color: #20b2aa;">)</span>,
                LANDSAT<span style="color: #daa520;">7</span> <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>
                                ETM <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">data.frame</span><span style="color: #20b2aa;">(</span>band <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>B,<span style="color: #daa520;">1</span>:<span style="color: #daa520;">8</span><span style="color: #20b2aa;">)</span>,
                                                bandtype <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span>REF, <span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>, TIR, REF, PAN<span style="color: #20b2aa;">)</span>,
                                                spatRes<span style="color: #daa520;">1</span> <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>, <span style="color: #daa520;">7</span><span style="color: #20b2aa;">)</span>, <span style="color: #daa520;">15</span><span style="color: #20b2aa;">)</span>,
                                                spatRes<span style="color: #daa520;">2</span> <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>,<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>, <span style="color: #daa520;">60</span>, <span style="color: #daa520;">30</span>, <span style="color: #daa520;">15</span><span style="color: #20b2aa;">)</span>,  <span style="color: #00bfff;">## </span><span style="color: #00bfff;">ETM+ Band </span><span style="color: #daa520;">6</span><span style="color: #00bfff;"> is acquired at </span><span style="color: #daa520;">60</span><span style="color: #00bfff;">-meter resolution. Products processed after February </span><span style="color: #daa520;">25</span><span style="color: #00bfff;">, </span><span style="color: #daa520;">2010</span><span style="color: #00bfff;"> are resampled to </span><span style="color: #daa520;">30</span><span style="color: #00bfff;">-meter pixels.</span>
                                                centerWavl <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">0</span>.<span style="color: #daa520;">485</span>, <span style="color: #daa520;">0</span>.<span style="color: #daa520;">560</span>, <span style="color: #daa520;">0</span>.<span style="color: #daa520;">660</span>, <span style="color: #daa520;">0</span>.<span style="color: #daa520;">835</span>, <span style="color: #daa520;">1</span>.<span style="color: #daa520;">650</span>,<span style="color: #daa520;">11</span>.<span style="color: #daa520;">335</span>,<span style="color: #daa520;">2</span>.<span style="color: #daa520;">220</span>,<span style="color: #daa520;">0</span>.<span style="color: #daa520;">706</span><span style="color: #20b2aa;">)</span>,
                                                esun <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">1997</span>,<span style="color: #daa520;">1812</span>,<span style="color: #daa520;">1533</span>,<span style="color: #daa520;">1039</span>,<span style="color: #daa520;">230</span>.<span style="color: #daa520;">8</span>,<span style="color: #daa520;">NA</span>,<span style="color: #daa520;">84</span>.<span style="color: #daa520;">9</span>,<span style="color: #daa520;">1362</span><span style="color: #20b2aa;">)</span>
                                <span style="color: #20b2aa;">)</span>
                <span style="color: #20b2aa;">)</span>,
                LANDSAT<span style="color: #daa520;">8</span> <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>
                                OLI_TIRS <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">data.frame</span><span style="color: #20b2aa;">(</span>band <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>B,<span style="color: #daa520;">1</span>:<span style="color: #daa520;">11</span><span style="color: #20b2aa;">)</span>, BQA<span style="color: #20b2aa;">)</span>,
                                                bandtype <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span>REF, <span style="color: #daa520;">7</span><span style="color: #20b2aa;">)</span>, PAN, REF, TIR, TIR, QA<span style="color: #20b2aa;">)</span>,
                                                spatRes<span style="color: #daa520;">1</span> <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>, <span style="color: #daa520;">7</span><span style="color: #20b2aa;">)</span>, <span style="color: #daa520;">15</span>, <span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>,<span style="color: #daa520;">4</span><span style="color: #20b2aa;">))</span>,
                                                spatRes<span style="color: #daa520;">2</span> <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>, <span style="color: #daa520;">7</span><span style="color: #20b2aa;">)</span>, <span style="color: #daa520;">15</span>, <span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">30</span>,<span style="color: #daa520;">4</span><span style="color: #20b2aa;">))</span>,  <span style="color: #00bfff;">## </span><span style="color: #00bfff;">ETM+ Band </span><span style="color: #daa520;">6</span><span style="color: #00bfff;"> is acquired at </span><span style="color: #daa520;">60</span><span style="color: #00bfff;">-meter resolution. Products processed after February </span><span style="color: #daa520;">25</span><span style="color: #00bfff;">, </span><span style="color: #daa520;">2010</span><span style="color: #00bfff;"> are resampled to </span><span style="color: #daa520;">30</span><span style="color: #00bfff;">-meter pixels.</span>
                                                centerWavl <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">0</span>.<span style="color: #daa520;">44</span>,<span style="color: #daa520;">0</span>.<span style="color: #daa520;">48</span>,<span style="color: #daa520;">0</span>.<span style="color: #daa520;">56</span>,<span style="color: #daa520;">0</span>.<span style="color: #daa520;">655</span>,<span style="color: #daa520;">0</span>.<span style="color: #daa520;">865</span>,<span style="color: #daa520;">1</span>.<span style="color: #daa520;">61</span>,<span style="color: #daa520;">2</span>.<span style="color: #daa520;">2</span>,<span style="color: #daa520;">0</span>.<span style="color: #daa520;">59</span>,<span style="color: #daa520;">1</span>.<span style="color: #daa520;">37</span>,<span style="color: #daa520;">10</span>.<span style="color: #daa520;">6</span>,<span style="color: #daa520;">11</span>.<span style="color: #daa520;">5</span>, <span style="color: #daa520;">NA</span><span style="color: #20b2aa;">)</span>, 
                                                esun <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #daa520;">NA</span>, <span style="color: #daa520;">2067</span>, <span style="color: #daa520;">1893</span>, <span style="color: #daa520;">1603</span>, <span style="color: #daa520;">972</span>.<span style="color: #daa520;">6</span>, <span style="color: #daa520;">245</span>, <span style="color: #daa520;">79</span>.<span style="color: #daa520;">72</span>, <span style="color: #daa520;">NA</span>, <span style="color: #daa520;">399</span>.<span style="color: #daa520;">7</span>, <span style="color: #daa520;">NA</span>, <span style="color: #daa520;">NA</span>, <span style="color: #daa520;">NA</span> <span style="color: #20b2aa;">)</span> <span style="color: #00bfff;">## </span><span style="color: #00bfff;">http://www.gisagmaps.com/landsat-</span><span style="color: #daa520;">8</span><span style="color: #00bfff;">-atco/ ##http://landsat.usgs.gov/Landsat</span><span style="color: #daa520;">8</span><span style="color: #00bfff;">_Using_Product.php</span>
                                <span style="color: #20b2aa;">)</span>
                <span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">)</span> 
exponents <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span><span style="color: #00ffff;">-</span><span style="color: #daa520;">4</span>, <span style="color: #00ffff;">-</span><span style="color: #daa520;">2</span>, <span style="color: #00ffff;">-</span><span style="color: #daa520;">1</span>, <span style="color: #00ffff;">-</span>.<span style="color: #daa520;">7</span>, <span style="color: #00ffff;">-</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>
<span style="color: #ff00ff;">for</span><span style="color: #20b2aa;">(</span>s <span style="color: #ff00ff;">in</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>LANDSAT.db<span style="color: #20b2aa;">)){</span>
        bandType                <span style="color: #00ffff;">&lt;-</span> LANDSAT.db<span style="color: #20b2aa;">[[</span>s<span style="color: #20b2aa;">]][[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]][</span>,bandtype<span style="color: #20b2aa;">]</span> <span style="color: #00ffff;">==</span> REF
        centerWavl              <span style="color: #00ffff;">&lt;-</span> LANDSAT.db<span style="color: #20b2aa;">[[</span>s<span style="color: #20b2aa;">]][[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]][</span>bandType, centerWavl<span style="color: #20b2aa;">]</span> 
        bands                   <span style="color: #00ffff;">&lt;-</span> LANDSAT.db<span style="color: #20b2aa;">[[</span>s<span style="color: #20b2aa;">]][[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]][</span>bandType, band<span style="color: #20b2aa;">]</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Calc Chavez Tab </span><span style="color: #daa520;">1</span>
        TAB<span style="color: #daa520;">1</span>                    <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">sapply</span><span style="color: #20b2aa;">(</span>exponents, <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span> centerWavl ^ x<span style="color: #20b2aa;">)</span>
        <span style="color: #ff6347;">rownames</span><span style="color: #20b2aa;">(</span>TAB<span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>  <span style="color: #00ffff;">&lt;-</span> bands
        <span style="color: #ff6347;">colnames</span><span style="color: #20b2aa;">(</span>TAB<span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>  <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">c</span><span style="color: #20b2aa;">(</span>veryClear, clear, moderate, hazy, veryHazy<span style="color: #20b2aa;">)</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Calc Chavez Tab </span><span style="color: #daa520;">2</span><span style="color: #00bfff;">, but only until SHVB = B</span><span style="color: #daa520;">4</span><span style="color: #00bfff;">, larger wavelengths dont make sense to estimate haze</span>
        TAB<span style="color: #daa520;">2</span> <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">lapply</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"B"</span>, <span style="color: #daa520;">1</span>:<span style="color: #daa520;">4</span><span style="color: #20b2aa;">)</span>, <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>SHVB<span style="color: #20b2aa;">){</span> <span style="color: #ff6347;">sweep</span><span style="color: #20b2aa;">(</span>TAB<span style="color: #daa520;">1</span>, <span style="color: #daa520;">2</span>, TAB<span style="color: #daa520;">1</span><span style="color: #20b2aa;">[</span>SHVB,<span style="color: #20b2aa;">]</span>, <span style="color: #00ff00;">"/"</span><span style="color: #20b2aa;">)})</span>
        TAB<span style="color: #daa520;">2</span> <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">do.call</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"cbind"</span>, TAB<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span>
        <span style="color: #ff6347;">colnames</span><span style="color: #20b2aa;">(</span>TAB<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"B"</span>, <span style="color: #daa520;">1</span>:<span style="color: #daa520;">4</span><span style="color: #20b2aa;">)</span>, each <span style="color: #00ffff;">=</span> <span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>,<span style="color: #00ff00;">"_"</span>, <span style="color: #ff6347;">colnames</span><span style="color: #20b2aa;">(</span>TAB<span style="color: #daa520;">2</span><span style="color: #20b2aa;">))</span>

        LANDSAT.db<span style="color: #20b2aa;">[[</span>s<span style="color: #20b2aa;">]][[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]]</span> <span style="color: #00ffff;">&lt;-</span>  <span style="color: #ff6347;">merge</span><span style="color: #20b2aa;">(</span>LANDSAT.db<span style="color: #20b2aa;">[[</span>s<span style="color: #20b2aa;">]][[</span><span style="color: #daa520;">1</span><span style="color: #20b2aa;">]]</span> , TAB<span style="color: #daa520;">2</span>, by.x <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"band"</span>, by.y <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">"row.names"</span>, all.x <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span>, sort <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
