html/RStoolbox_0.01_(2014-5-6_by_).html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> readMeta.R</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param unifiedMetadata logical. If \code{TRUE} some relevant etadata of Landsat </span><span style="color: #daa520;">5</span><span style="color: #00bfff;">:</span><span style="color: #daa520;">8</span><span style="color: #00bfff;"> are homogenized into a standard format and appended to the original metadata.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@return Returns a list containing the Metadata of the MTL file, structured by the original grouping.</span>
<span style="color: #00bfff;"># </span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@import landsat</span>
<span style="color: #00bfff;"># </span><span style="color: #ffa500;">@export</span><span style="color: #00bfff;"> </span>
<span style="color: #00bfff;"># </span>
<span style="color: #00bfff;"># </span>
<span style="color: #00bfff;"># </span>
<span style="color: #ff6347;">readMeta</span> <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>file, unifiedMetadata <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span><span style="color: #20b2aa;">){</span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>!<span style="color: #ff6347;">grepl</span><span style="color: #20b2aa;">(</span>MTL, file<span style="color: #20b2aa;">)</span> &amp; !<span style="color: #ff6347;">grepl</span><span style="color: #20b2aa;">(</span>xml, file<span style="color: #20b2aa;">))</span> <span style="color: #ff00ff;">warning</span><span style="color: #20b2aa;">(</span>The Landsat metadata file you have specified looks unusual. Typically the filename contains the string <span style="color: #00ff00;">'MTL'</span> or <span style="color: #00ff00;">'xml'</span>. Are you sure you specified the right file? \n I<span style="color: #00ff00;">'ll try to read it but check the results!)</span>

<span style="color: #00ff00;">        ## Read mtl file</span>
<span style="color: #00ff00;">        metaDataFormat &lt;- if(grepl(xml, file)) XML else MTL</span>

<span style="color: #00ff00;">        if(metaDataFormat == MTL) {</span>
<span style="color: #00ff00;">                ## PROCESS LPS MTL FILES</span>

<span style="color: #00ff00;">                meta &lt;- read.delim(file, sep = =, head = FALSE, stringsAsFactors = FALSE, strip.white = TRUE, skip = </span><span style="color: #daa520;">1</span><span style="color: #00ff00;">, skipNul = TRUE)</span>
<span style="color: #00ff00;">                meta &lt;- meta[-(nrow(meta)-c(</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">,</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">)),]</span>

<span style="color: #00ff00;">                ## Retrieve groups</span>
<span style="color: #00ff00;">                l &lt;- meta[grep(GROUP,meta[,</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">]),]</span>

<span style="color: #00ff00;">                ## Assemble metadata list</span>
<span style="color: #00ff00;">                meta &lt;- lapply(unique(l[,</span><span style="color: #daa520;">2</span><span style="color: #00ff00;">]), FUN = function(x){</span>
<span style="color: #00ff00;">                                        w &lt;- which(meta[,</span><span style="color: #daa520;">2</span><span style="color: #00ff00;">] == x)</span>
<span style="color: #00ff00;">                                        m &lt;- meta[(w[</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">]+</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">):(w[</span><span style="color: #daa520;">2</span><span style="color: #00ff00;">]-</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">),]</span>
<span style="color: #00ff00;">                                        rownames(m) &lt;- m[,</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">]</span>
<span style="color: #00ff00;">                                        m &lt;- m[ , </span><span style="color: #daa520;">2</span><span style="color: #00ff00;">, drop = FALSE]</span>
<span style="color: #00ff00;">                                        colnames(m) &lt;- VALUE</span>
<span style="color: #00ff00;">                                        return(m)</span>
<span style="color: #00ff00;">                                })</span>

<span style="color: #00ff00;">                names(meta) &lt;- unique(l[,</span><span style="color: #daa520;">2</span><span style="color: #00ff00;">])</span>

<span style="color: #00ff00;">                ## Legacy MTL? </span>
<span style="color: #00ff00;">                legacy &lt;- PROCESSING_SOFTWARE %in% rownames(meta$PRODUCT_METADATA)</span>
<span style="color: #00ff00;">                if(legacy) message(This scene was processed before August </span><span style="color: #daa520;">29</span><span style="color: #00ff00;">, </span><span style="color: #daa520;">2012</span><span style="color: #00ff00;">. Using MTL legacy format. Some minor infos such as SCENE_ID will be missing)</span>

<span style="color: #00ff00;">                if(unifiedMetadata){</span>

<span style="color: #00ff00;">                        meta[[UNIFIED_METADATA]] &lt;- list(</span>
<span style="color: #00ff00;">                                        SPACECRAFT_ID           = {SAT &lt;- paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(LANDSAT, .getNumeric(meta$PRODUCT_METADATA[SPACECRAFT_ID,]))},</span>
<span style="color: #00ff00;">                                        SENSOR_ID                       = meta$PRODUCT_METADATA[SENSOR_ID,]     ,                       </span>
<span style="color: #00ff00;">                                        SCENE_ID                        = meta$METADATA_FILE_INFO[LANDSAT_SCENE_ID,],  ## could assemble name for legacy files: http://landsat.usgs.gov/naming_conventions_scene_identifiers.php</span>
<span style="color: #00ff00;">                                        DATA_TYPE                       = if(!legacy) meta$PRODUCT_METADATA[DATA_TYPE,] else meta$PRODUCT_METADATA[PRODUCT_TYPE,],</span>
<span style="color: #00ff00;">                                        ACQUISITION_DATE        = {date &lt;- if(!legacy) meta$PRODUCT_METADATA[DATE_ACQUIRED,] else meta$PRODUCT_METADATA[ACQUISITION_DATE,]},</span>
<span style="color: #00ff00;">                                        PROCESSING_DATE         = if(!legacy) meta$METADATA_FILE_INFO[FILE_DATE,] else meta$METADATA_FILE_INFO[PRODUCT_CREATION_TIME,], </span>
<span style="color: #00ff00;">                                        PATH                            = as.numeric(meta$PRODUCT_METADATA[WRS_PATH,]),</span>
<span style="color: #00ff00;">                                        ROW                                     = if(!legacy) as.numeric(meta$PRODUCT_METADATA[WRS_ROW,]) else as.numeric(meta$PRODUCT_METADATA[STARTING_ROW,]),</span>
<span style="color: #00ff00;">                                        RADIOMETRIC_RES         = if(SAT == LANDSAT</span><span style="color: #daa520;">8</span><span style="color: #00ff00;">) </span><span style="color: #daa520;">16</span><span style="color: #00ff00;"> else </span><span style="color: #daa520;">8</span><span style="color: #00ff00;">,                                </span>
<span style="color: #00ff00;">                                        FILES                           = {files &lt;- row.names(meta[[PRODUCT_METADATA]])[grep(^.*FILE_NAME, row.names(meta$PRODUCT_METADATA))]</span>
<span style="color: #00ff00;">                                                files &lt;- files[grep(^.*BAND,files)]</span>
<span style="color: #00ff00;">                                                files &lt;- meta[[PRODUCT_METADATA]][files,]       },</span>

<span style="color: #00ff00;">                                        BANDS                           = {junk &lt;- unique(sapply(str_split(files, _B), [ ,</span><span style="color: #daa520;">1</span><span style="color: #00ff00;"> ))</span>
<span style="color: #00ff00;">                                                bds &lt;- str_replace(str_replace(files, paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(junk,_), ), {if(SAT==LANDSAT</span><span style="color: #daa520;">5</span><span style="color: #00ff00;">) </span><span style="color: #daa520;">0</span><span style="color: #00ff00;">.TIF else .TIF}, )</span>
<span style="color: #00ff00;">                                        },</span>
<span style="color: #00ff00;">                                        BAND_TYPE                       = {</span>
<span style="color: #00ff00;">                                                ty &lt;- rep(image, length(bds))</span>
<span style="color: #00ff00;">                                                ty[grepl(QA, bds)] &lt;- qa</span>
<span style="color: #00ff00;">                                                ty</span>
<span style="color: #00ff00;">                                        },</span>
<span style="color: #00ff00;">                                        ## INSOLATION</span>
<span style="color: #00ff00;">                                        NA_VALUE                        = rep(</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">, length(ty)),</span>
<span style="color: #00ff00;">                                        SUN_AZIMUTH                     = if(!legacy) as.numeric(meta$IMAGE_ATTRIBUTES[SUN_AZIMUTH,]) else as.numeric(meta$PRODUCT_PARAMETERS[SUN_AZIMUTH,]),</span>
<span style="color: #00ff00;">                                        SUN_ELEVATION           = if(!legacy) as.numeric(meta$IMAGE_ATTRIBUTES[SUN_ELEVATION,]) else as.numeric(meta$PRODUCT_PARAMETERS[SUN_ELEVATION,]),</span>
<span style="color: #00ff00;">                                        EARTH_SUN_DISTANCE  = {es &lt;- meta$IMAGE_ATTRIBUTES[EARTH_SUN_DISTANCE,]</span>
<span style="color: #00ff00;">                                                if(is.null(es) || is.na(es)) es &lt;- .ESdist(date)</span>
<span style="color: #00ff00;">                                                as.numeric(es)}</span>
<span style="color: #00ff00;">                        )</span>

<span style="color: #00ff00;">                        ## RADIOMETRIC CORRECTION/RESCALING PARAMETERS</span>
<span style="color: #00ff00;">                        RADCOR &lt;-  if(!legacy) { list(          </span>
<span style="color: #00ff00;">                                                                RAD_OFFSET                              = {</span>
<span style="color: #00ff00;">                                                                        r &lt;- meta$RADIOMETRIC_RESCALING</span>
<span style="color: #00ff00;">                                                                        r[,</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">]           &lt;- as.numeric(r[,</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">])</span>
<span style="color: #00ff00;">                                                                        bandnames       &lt;- str_c(B, str_replace(rownames(r), ^.*_BAND_, ))</span>
<span style="color: #00ff00;">                                                                        go                      &lt;- grep(RADIANCE_ADD*, rownames(r))</span>
<span style="color: #00ff00;">                                                                        ro                      &lt;- r[go,]</span>
<span style="color: #00ff00;">                                                                        names(ro)       &lt;- bandnames[go]</span>
<span style="color: #00ff00;">                                                                        ro},</span>
<span style="color: #00ff00;">                                                                RAD_GAIN                                = {go                   &lt;- grep(RADIANCE_MULT*, rownames(r))</span>
<span style="color: #00ff00;">                                                                        ro                      &lt;- r[go,]</span>
<span style="color: #00ff00;">                                                                        names(ro)       &lt;- bandnames[go]</span>
<span style="color: #00ff00;">                                                                        ro},</span>
<span style="color: #00ff00;">                                                                REF_OFFSET                              = {     go                      &lt;- grep(REFLECTANCE_ADD*, rownames(r))</span>
<span style="color: #00ff00;">                                                                        ro                      &lt;- r[go,]</span>
<span style="color: #00ff00;">                                                                        names(ro)       &lt;- bandnames[go]</span>
<span style="color: #00ff00;">                                                                        ro},</span>
<span style="color: #00ff00;">                                                                REF_GAIN                                = {go                   &lt;- grep(REFLECTANCE_MULT*, rownames(r))</span>
<span style="color: #00ff00;">                                                                        ro                      &lt;- r[go,]</span>
<span style="color: #00ff00;">                                                                        names(ro)       &lt;- bandnames[go]</span>
<span style="color: #00ff00;">                                                                        ro})</span>

<span style="color: #00ff00;">                                        } else {</span>

<span style="color: #00ff00;">                                                bandnames &lt;- paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(B, .getNumeric(rownames(meta$MIN_MAX_RADIANCE)))</span>
<span style="color: #00ff00;">                                                bandnames &lt;- bandnames[seq(</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">, length(bandnames), </span><span style="color: #daa520;">2</span><span style="color: #00ff00;">)]</span>

<span style="color: #00ff00;">                                                L &lt;- diff(as.numeric(meta$MIN_MAX_RADIANCE[,</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">]))</span>
<span style="color: #00ff00;">                                                L &lt;- L[seq(</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">, length(L), </span><span style="color: #daa520;">2</span><span style="color: #00ff00;">)] </span>

<span style="color: #00ff00;">                                                Q &lt;- diff(as.numeric(meta$MIN_MAX_PIXEL_VALUE[,</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">]))  </span>
<span style="color: #00ff00;">                                                Q &lt;- Q[seq(</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">, length(Q), </span><span style="color: #daa520;">2</span><span style="color: #00ff00;">)]</span>

<span style="color: #00ff00;">                                                RAD_GAIN        &lt;- L/Q</span>
<span style="color: #00ff00;">                                                RAD_OFFSET      &lt;- as.numeric(meta$MIN_MAX_RADIANCE[,</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">])[seq(</span><span style="color: #daa520;">2</span><span style="color: #00ff00;">,nrow(meta$MIN_MAX_RADIANCE),</span><span style="color: #daa520;">2</span><span style="color: #00ff00;">)] - (RAD_GAIN) * </span><span style="color: #daa520;">1</span>

<span style="color: #00ff00;">                                                names(RAD_OFFSET) &lt;- names(RAD_GAIN) &lt;- bandnames</span>

<span style="color: #00ff00;">                                                list(RAD_OFFSET = RAD_OFFSET, RAD_GAIN = RAD_GAIN)</span>

<span style="color: #00ff00;">                                        }</span>

<span style="color: #00ff00;">         if(SAT == LANDSAT</span><span style="color: #daa520;">8</span><span style="color: #00ff00;">){</span>
<span style="color: #00ff00;">                                RADCOR$K</span><span style="color: #daa520;">1</span><span style="color: #00ff00;"> ={ r &lt;- meta$TIRS_THERMAL_CONSTANTS</span>
<span style="color: #00ff00;">                                        r[,</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">]           &lt;- as.numeric(r[,</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">])</span>
<span style="color: #00ff00;">                                        bandnames       &lt;- str_c(B, str_replace(rownames(r), ^.*_BAND_, ))</span>
<span style="color: #00ff00;">                                        go                      &lt;- grep(K</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">, rownames(r))</span>
<span style="color: #00ff00;">                                        ro                      &lt;- r[go,]</span>
<span style="color: #00ff00;">                                        names(ro)       &lt;- bandnames[go]</span>
<span style="color: #00ff00;">                                        ro}</span>
<span style="color: #00ff00;">                                RADCOR$K</span><span style="color: #daa520;">2</span><span style="color: #00ff00;"> = {go                 &lt;- grep(K</span><span style="color: #daa520;">2</span><span style="color: #00ff00;">, rownames(r))</span>
<span style="color: #00ff00;">                                        ro                      &lt;- r[go,]</span>
<span style="color: #00ff00;">                                        names(ro)       &lt;- bandnames[go]</span>
<span style="color: #00ff00;">                                        ro}                             </span>
<span style="color: #00ff00;">                        } else {</span>
<span style="color: #00ff00;">                                TAB</span><span style="color: #daa520;">7</span><span style="color: #00ff00;"> &lt;- list(LANDSAT</span><span style="color: #daa520;">4</span><span style="color: #00ff00;"> = c(B</span><span style="color: #daa520;">6</span><span style="color: #00ff00;">=</span><span style="color: #daa520;">671</span><span style="color: #00ff00;">.</span><span style="color: #daa520;">62</span><span style="color: #00ff00;">,B</span><span style="color: #daa520;">6</span><span style="color: #00ff00;">=</span><span style="color: #daa520;">1284</span><span style="color: #00ff00;">.</span><span style="color: #daa520;">3</span><span style="color: #00ff00;">), # TAB</span><span style="color: #daa520;">7</span><span style="color: #00ff00;"> from Chander </span><span style="color: #daa520;">2009</span>
<span style="color: #00ff00;">                                                LANDSAT</span><span style="color: #daa520;">5</span><span style="color: #00ff00;"> = c(B</span><span style="color: #daa520;">6</span><span style="color: #00ff00;">=</span><span style="color: #daa520;">607</span><span style="color: #00ff00;">.</span><span style="color: #daa520;">76</span><span style="color: #00ff00;">,B</span><span style="color: #daa520;">6</span><span style="color: #00ff00;">=</span><span style="color: #daa520;">1260</span><span style="color: #00ff00;">.</span><span style="color: #daa520;">56</span><span style="color: #00ff00;">),</span>
<span style="color: #00ff00;">                                                LANDSAT</span><span style="color: #daa520;">7</span><span style="color: #00ff00;"> = c(B</span><span style="color: #daa520;">6</span><span style="color: #00ff00;">=</span><span style="color: #daa520;">666</span><span style="color: #00ff00;">.</span><span style="color: #daa520;">09</span><span style="color: #00ff00;">,B</span><span style="color: #daa520;">6</span><span style="color: #00ff00;">=</span><span style="color: #daa520;">1282</span><span style="color: #00ff00;">.</span><span style="color: #daa520;">71</span><span style="color: #00ff00;">))</span>

<span style="color: #00ff00;">                                RADCOR$K</span><span style="color: #daa520;">1</span><span style="color: #00ff00;"> &lt;- TAB</span><span style="color: #daa520;">7</span><span style="color: #00ff00;">[[SAT]][</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">]</span>
<span style="color: #00ff00;">                                RADCOR$K</span><span style="color: #daa520;">2</span><span style="color: #00ff00;"> &lt;- TAB</span><span style="color: #daa520;">7</span><span style="color: #00ff00;">[[SAT]][</span><span style="color: #daa520;">2</span><span style="color: #00ff00;">]</span>
<span style="color: #00ff00;">                        }</span>

<span style="color: #00ff00;">                        meta[[UNIFIED_METADATA]] &lt;- c(meta[[UNIFIED_METADATA]], RADCOR)</span>
<span style="color: #00ff00;">                }</span>
<span style="color: #00ff00;">        } else {</span>
<span style="color: #00ff00;">                ## PROCESS ESPA LEDAPS XML FILES</span>
<span style="color: #00ff00;">                meta &lt;- xmlParse(file)</span>
<span style="color: #00ff00;">                meta &lt;- xmlToList(meta)</span>
<span style="color: #00ff00;">                names(meta$bands) &lt;- str_replace_all(unlist(sapply(meta$bands, [, long_name)),  , _)</span>

<span style="color: #00ff00;">                if(unifiedMetadata){</span>

<span style="color: #00ff00;">                        atts &lt;- sapply(meta$bands, [, .attrs)</span>

<span style="color: #00ff00;">                        meta[[UNIFIED_METADATA]] &lt;- list(</span>
<span style="color: #00ff00;">                                        SPACECRAFT_ID           = {SAT &lt;- paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(LANDSAT, .getNumeric(meta$global_metadata$satellite))},</span>
<span style="color: #00ff00;">                                        SENSOR_ID                       = meta$global_metadata$instrument,                      </span>
<span style="color: #00ff00;">                                        SCENE_ID                        = SID &lt;- str_replace(meta$global_metadata$lpgs_metadata_file, _MTL.txt, ),  ## could assemble name for legacy files: http://landsat.usgs.gov/naming_conventions_scene_identifiers.php</span>
<span style="color: #00ff00;">                                        DATA_TYPE                       = if(meta$bands[[</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">]]$.attrs[product] == sr_refl) SR, </span>
<span style="color: #00ff00;">                                        ACQUISITION_DATE        = {date &lt;- meta$global_metadata$acquisition_date},</span>
<span style="color: #00ff00;">                                        PROCESSING_DATE         = meta$bands[[</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">]]$production_date, </span>
<span style="color: #00ff00;">                                        PATH                            = as.numeric(meta$global_metadata$wrs[path]),</span>
<span style="color: #00ff00;">                                        ROW                                     = as.numeric(meta$global_metadata$wrs[row]),</span>

<span style="color: #00ff00;">                                        FILES                           = {files &lt;- sapply(meta$bands, [[, file_name)</span>
<span style="color: #00ff00;">                                                names(files) &lt;- NULL</span>
<span style="color: #00ff00;">                                                files},                                 </span>
<span style="color: #00ff00;">                                        BANDS                           = {     </span>
<span style="color: #00ff00;">                                                bds &lt;- grepl(_band, files)</span>
<span style="color: #00ff00;">                                                toa &lt;- grepl(_toa_, files)</span>
<span style="color: #00ff00;">                                                qas &lt;- grepl(qa, files) </span>
<span style="color: #00ff00;">                                                bnames                          &lt;- toupper(str_replace(files, paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(SID, _), ))                                        </span>
<span style="color: #00ff00;">                                                bnames[bds]                     &lt;- paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(B, .getNumeric(bnames[bds]))</span>
<span style="color: #00ff00;">                                                bnames[bds &amp; qas]       &lt;- paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(bnames[bds &amp; qas], _QA)</span>
<span style="color: #00ff00;">                                                bnames                          &lt;- str_replace(str_replace(str_replace(bnames, \\.TIF, ), SR_, ), TOA_, )</span>
<span style="color: #00ff00;">                                                bnames[toa]             &lt;- paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(bnames[toa], _TOA)</span>
<span style="color: #00ff00;">                                                bnames</span>
<span style="color: #00ff00;">                                        },</span>
<span style="color: #00ff00;">                                        BAND_TYPE                       = {ty &lt;- sapply(atts, [ , category)</span>
<span style="color: #00ff00;">                                                names(ty) &lt;- NULL</span>
<span style="color: #00ff00;">                                                ty</span>
<span style="color: #00ff00;">                                        },</span>
<span style="color: #00ff00;">                                        NA_VALUE                        = as.numeric(sapply(atts, [ , fill_value)),</span>
<span style="color: #00ff00;">                                        SATURATE_VALUE          = as.numeric(sapply(atts, [ , saturate_value)),</span>
<span style="color: #00ff00;">                                        SCALE_FACTOR            = as.numeric(sapply(atts, [ , scale_factor)),</span>

<span style="color: #00ff00;">                                        SUN_AZIMUTH                     = as.numeric(meta$global_metadata$solar_angles[azimuth]),</span>
<span style="color: #00ff00;">                                        SUN_ELEVATION           = </span><span style="color: #daa520;">90</span><span style="color: #00ff00;"> - as.numeric(meta$global_metadata$solar_angles[zenith]),</span>
<span style="color: #00ff00;">                                        EARTH_SUN_DISTANCE  = {.ESdist(date)}</span>
<span style="color: #00ff00;">                        )</span>

<span style="color: #00ff00;">                }</span>

<span style="color: #00ff00;">        }</span>
<span style="color: #00ff00;">        return(meta)</span>
<span style="color: #00ff00;">}</span>
<span style="color: #00ff00;"># Import separate Landsat files into single stack</span>
<span style="color: #00ff00;"># </span>
<span style="color: #00ff00;"># Reads Landsat MTL or XML metadata files and loads single Landsat Tiffs into a rasterStack.</span>
<span style="color: #00ff00;"># Be aware that by default stackLS() does NOT import panchromatic bands nor thermal bands with resolutions != </span><span style="color: #daa520;">30</span><span style="color: #00ff00;">m.</span>
<span style="color: #00ff00;"># </span>
<span style="color: #00ff00;"># @param file character. Path to Landsat MTL metadata file.</span>
<span style="color: #00ff00;"># @param allResolutions logical. if \code{TRUE} a list will be returned with length = unique spatial resolutions.</span>
<span style="color: #00ff00;"># @param resampleTIR logical. As of  the USGS resamples TIR bands to </span><span style="color: #daa520;">30</span><span style="color: #00ff00;">m. Use this option if you use data processed prior to February </span><span style="color: #daa520;">25</span><span style="color: #00ff00;">, </span><span style="color: #daa520;">2010</span><span style="color: #00ff00;"> which has not been resampled.</span>
<span style="color: #00ff00;"># @param resamplingMethod character. Method to use for TUR resampling (ngb or bilinear). Defaults to ngb (nearest neighbor).</span>
<span style="color: #00ff00;"># @param products character vector. Which products should be returned in the stack? (only relevant for LS</span><span style="color: #daa520;">8</span><span style="color: #00ff00;"> and LEDAPS processed products). image: image data, index: multiband indices, qa quality flag bands. </span>
<span style="color: #00ff00;"># @return Either a list of rasterStacks comprising all resolutions or only one rasterStack comprising only </span><span style="color: #daa520;">30</span><span style="color: #00ff00;">m resolution imagery</span>
<span style="color: #00ff00;"># @note </span>
<span style="color: #00ff00;"># Be aware that by default stackLS() does NOT import panchromatic bands nor thermal bands with resolutions != </span><span style="color: #daa520;">30</span><span style="color: #00ff00;">m. Use the allResolutions argument to import all layers.</span>
<span style="color: #00ff00;"># </span>
<span style="color: #00ff00;"># The USGS uses cubic convolution to resample TIR bands to </span><span style="color: #daa520;">30</span><span style="color: #00ff00;">m resolution. In the opinion of the author this may not be the best choice for supersampling. </span>
<span style="color: #00ff00;"># Therefore the default method in this implementation is nearest neighbor. Keep this in mind if you plan to compare TIR bands created by differing resampling routines.</span>
<span style="color: #00ff00;"># Typically, however, you will already have the USGS </span><span style="color: #daa520;">30</span><span style="color: #00ff00;">m TIR products, so no need to worry...</span>
<span style="color: #00ff00;"># </span><span style="color: #ffa500;">@export</span>
<span style="color: #ff6347;">stackMeta</span><span style="color: #00ff00;"> &lt;- function(file, allResolutions = FALSE,  resampleTIR = FALSE, resamplingMethod = ngb, products = c(image, index, qa)){</span>

<span style="color: #00ff00;">        ## Read metadata and extract layer file names</span>
<span style="color: #00ff00;">        meta  &lt;- readMeta(file)</span>
<span style="color: #00ff00;">        files &lt;- meta$UNIFIED_METADATA$FILES</span>

<span style="color: #00ff00;">        ## Load layers</span>
<span style="color: #00ff00;">        path  &lt;- if(basename(file) != file)  str_replace(file, basename(file), ) else NULL</span>

<span style="color: #00ff00;">        ## Import rasters</span>
<span style="color: #00ff00;">        rl &lt;- lapply(paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(path, files), raster)</span>
<span style="color: #00ff00;">        resL &lt;- lapply(lapply(rl, res),[, </span><span style="color: #daa520;">1</span><span style="color: #00ff00;">)</span>

<span style="color: #00ff00;">        if(any(resL &gt; </span><span style="color: #daa520;">30</span><span style="color: #00ff00;">)) {</span>
<span style="color: #00ff00;">                message(Your Landsat data includes TIR band(s) which were not resampled to </span><span style="color: #daa520;">30</span><span style="color: #00ff00;">m.</span>
<span style="color: #00ff00;">                                                \nYou can set resampleTIR = TRUE to resample TIR bands to </span><span style="color: #daa520;">30</span><span style="color: #00ff00;">m if you want a single stack)</span>

<span style="color: #00ff00;">                ## Resample TIR to </span><span style="color: #daa520;">30</span><span style="color: #00ff00;">m</span>
<span style="color: #00ff00;">                if(resampleTIR){</span>
<span style="color: #00ff00;">                        for(i in which(resL &gt; </span><span style="color: #daa520;">30</span><span style="color: #00ff00;">))</span>
<span style="color: #00ff00;">                                rl[[i]] &lt;- resample(rl[[i]], rl[[which(resL == </span><span style="color: #daa520;">30</span><span style="color: #00ff00;">)[</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">]]], method = resamplingMethod)             </span>
<span style="color: #00ff00;">                }</span>
<span style="color: #00ff00;">        }</span>

<span style="color: #00ff00;">        ## Stack</span>
<span style="color: #00ff00;">        returnRes &lt;- if(allResolutions) unlist(unique(resL)) else </span><span style="color: #daa520;">30</span>

<span style="color: #00ff00;">        LS      &lt;- lapply(returnRes, function(x){</span>
<span style="color: #00ff00;">                                s                       &lt;- stack(rl[resL == x])</span>
<span style="color: #00ff00;">                                names(s)        &lt;- meta$UNIFIED_METADATA$BANDS[resL == x]</span>
<span style="color: #00ff00;">                                NAvalue(s)      &lt;- meta$UNIFIED_METADATA$NA_VALUE[resL == x]    </span>
<span style="color: #00ff00;">                                s &lt;- s[[ which(names(s) %in% meta$UNIFIED_METADATA$BANDS[meta$UNIFIED_METADATA$BAND_TYPE %in% products])        ]]</span>
<span style="color: #00ff00;">                                s</span>
<span style="color: #00ff00;">                        })</span>

<span style="color: #00ff00;">        if(!allResolutions) LS &lt;- LS[[</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">]]</span>

<span style="color: #00ff00;">        return(LS)</span>
<span style="color: #00ff00;">}</span>
</pre>
</div>
</div>
</div>
