html/RStoolbox_0.01_(2014-5-6_by_).html
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> RStoolbox.R</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #daa520;">NULL</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> spectralIndices.R</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param bands list of band designations. See notes for details</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param maskRaster Raster layer containing a binary mask to exclude areas from prediction.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param verbose logical. prints progress, statistics and graphics during execution</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param ... further arguments such as filename etc. passed to \link[raster]{writeRaster}</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@return rasterBrick or rasterStack</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@seealso \code{\link[raster]{overlay}} </span>
<span style="color: #00bfff;"># </span><span style="color: #ffa500;">@export</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@examples</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">r &lt;- raster(ncol=</span><span style="color: #daa520;">10</span><span style="color: #00bfff;">,nrow=</span><span style="color: #daa520;">10</span><span style="color: #00bfff;">)</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">r[] &lt;- sample(</span><span style="color: #daa520;">1</span><span style="color: #00bfff;">:</span><span style="color: #daa520;">155</span><span style="color: #00bfff;">, </span><span style="color: #daa520;">100</span><span style="color: #00bfff;">, TRUE)</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">r &lt;- stack(r, r + </span><span style="color: #daa520;">90</span><span style="color: #00bfff;"> + rnorm(</span><span style="color: #daa520;">100</span><span style="color: #00bfff;">, </span><span style="color: #daa520;">10</span><span style="color: #00bfff;">)) </span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">names(r) &lt;- c(red, nir)</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">SI &lt;- spectralIndices(r, indices = c("SR", "NDVI"), bands = list(NIR = "nir", RED = "red"))</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">plot(SI)</span>
<span style="color: #ff6347;">spectralIndices</span> <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>inputRaster, indices <span style="color: #00ffff;">=</span> NDVI, sensor, bands , maskRaster <span style="color: #00ffff;">=</span> <span style="color: #daa520;">NULL</span>, verbose <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span>, ... <span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
        <span style="color: #00bfff;"># </span><span style="color: #00bfff;">TODO: add indices</span>
        <span style="color: #00bfff;"># </span><span style="color: #00bfff;">TODO: add examples</span>
        <span style="color: #00bfff;"># </span><span style="color: #00bfff;">TODO: add formulas to help file</span>
        <span style="color: #00bfff;"># </span><span style="color: #00bfff;">TODO: internal sensor db</span>
        <span style="color: #00bfff;"># </span><span style="color: #00bfff;">TODO: value checks?</span>
        <span style="color: #00bfff;"># </span><span style="color: #00bfff;">TODO: check sensor list for correctness and extend it </span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Sensor db</span>
        SENSORS <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>
                        LANDSAT<span style="color: #daa520;">5</span> <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>BLUE <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">1</span>, GREEN <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">2</span>, RED <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">3</span>, NIR <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">4</span>, MIR <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">7</span><span style="color: #20b2aa;">)</span>,
                        LANDSAT<span style="color: #daa520;">7</span> <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>BLUE <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">1</span>, GREEN <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">2</span>, RED <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">3</span>, NIR <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">4</span><span style="color: #20b2aa;">)</span>,
                        LANDSAT<span style="color: #daa520;">8</span> <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>BLUE <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">2</span>, GREEN <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">3</span>, RED <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">4</span>, NIR <span style="color: #00ffff;">=</span> B<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>
        <span style="color: #20b2aa;">)</span>

        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>!<span style="color: #ff6347;">missing</span><span style="color: #20b2aa;">(</span>sensor<span style="color: #20b2aa;">)){</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>!sensor <span style="color: #00ffff;">%</span><span style="color: #ff00ff;">in</span><span style="color: #00ffff;">%</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>SENSORS<span style="color: #20b2aa;">))</span> <span style="color: #ff00ff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>Unknown sensor. Please provide the <span style="color: #00ff00;">'bands'</span> argument or <span style="color: #00ff00;">'sensor'</span> as one of , <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>SENSORS<span style="color: #20b2aa;">)))</span>
                bands <span style="color: #00ffff;">&lt;-</span> SENSORS<span style="color: #20b2aa;">[[</span>sensor<span style="color: #20b2aa;">]]</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">any</span><span style="color: #20b2aa;">(</span>!bands <span style="color: #00ffff;">%</span><span style="color: #ff00ff;">in</span><span style="color: #00ffff;">%</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>inputRaster<span style="color: #20b2aa;">)))</span> <span style="color: #ff00ff;">stop</span><span style="color: #20b2aa;">(</span>Bandnames of inputRaster do not match the required format or are missing. Please provide <span style="color: #00ff00;">'bands'</span> argument manually or make sure the <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>inputRaster<span style="color: #20b2aa;">)</span> follow the <span style="color: #00ff00;">'B</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">'</span> <span style="color: #00ff00;">'B</span><span style="color: #daa520;">2</span><span style="color: #00ff00;">'</span>  ... format <span style="color: #ff00ff;">if</span> you want to make use of the <span style="color: #00ff00;">'sensor'</span> argument.<span style="color: #20b2aa;">)</span>
        <span style="color: #20b2aa;">}</span>
        bands <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">lapply</span><span style="color: #20b2aa;">(</span>bands, <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.character</span><span style="color: #20b2aa;">(</span>x<span style="color: #20b2aa;">))</span> <span style="color: #ff6347;">which</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>inputRaster<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">==</span> x<span style="color: #20b2aa;">)</span> <span style="color: #ff00ff;">else</span> x <span style="color: #20b2aa;">)</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Internal db</span>
        INDICES <span style="color: #00ffff;">&lt;-</span>  <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>
                        SR              <span style="color: #00ffff;">=</span> <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>NIR <span style="color: #00ffff;">/</span> RED<span style="color: #20b2aa;">}</span>,
                        DVI             <span style="color: #00ffff;">=</span> <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>NIR<span style="color: #00ffff;">-</span>RED<span style="color: #20b2aa;">}</span>,
                        NDVI    <span style="color: #00ffff;">=</span> <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{(</span>NIR<span style="color: #00ffff;">-</span>RED<span style="color: #20b2aa;">)</span><span style="color: #00ffff;">/</span><span style="color: #20b2aa;">(</span>NIR<span style="color: #00ffff;">+</span>RED<span style="color: #20b2aa;">)}</span>, 
                        TVI     <span style="color: #00ffff;">=</span> <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{(((</span>NIR<span style="color: #00ffff;">-</span>RED<span style="color: #20b2aa;">)</span><span style="color: #00ffff;">/</span><span style="color: #20b2aa;">(</span>NIR<span style="color: #00ffff;">+</span>RED<span style="color: #20b2aa;">))</span><span style="color: #00ffff;">+</span><span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span>^<span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">}</span>, 
                        MSAVI   <span style="color: #00ffff;">=</span> <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>NIR <span style="color: #00ffff;">+</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span> <span style="color: #00ffff;">-</span> <span style="color: #20b2aa;">(</span><span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span> * <span style="color: #ff6347;">sqrt</span><span style="color: #20b2aa;">((</span><span style="color: #daa520;">2</span> * NIR <span style="color: #00ffff;">+</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>^<span style="color: #daa520;">2</span> <span style="color: #00ffff;">-</span> <span style="color: #daa520;">8</span> * <span style="color: #20b2aa;">(</span>NIR <span style="color: #00ffff;">-</span> <span style="color: #20b2aa;">(</span><span style="color: #daa520;">2</span> * RED<span style="color: #20b2aa;">))))}</span>,
                        MSAVI<span style="color: #daa520;">2</span>  <span style="color: #00ffff;">=</span> <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{(</span><span style="color: #daa520;">2</span> * <span style="color: #20b2aa;">(</span>NIR <span style="color: #00ffff;">+</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">-</span> <span style="color: #ff6347;">sqrt</span><span style="color: #20b2aa;">((</span><span style="color: #daa520;">2</span> * NIR <span style="color: #00ffff;">+</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span>^<span style="color: #daa520;">2</span> <span style="color: #00ffff;">-</span> <span style="color: #daa520;">8</span> * <span style="color: #20b2aa;">(</span>NIR <span style="color: #00ffff;">-</span> RED<span style="color: #20b2aa;">)))</span> <span style="color: #00ffff;">/</span> <span style="color: #daa520;">2</span><span style="color: #20b2aa;">}</span>,
                        GEMI    <span style="color: #00ffff;">=</span> <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{(((</span>NIR^<span style="color: #daa520;">2</span> <span style="color: #00ffff;">-</span> RED^<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span> * <span style="color: #daa520;">2</span> <span style="color: #00ffff;">+</span> <span style="color: #20b2aa;">(</span>NIR * <span style="color: #daa520;">1</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">+</span> <span style="color: #20b2aa;">(</span>RED * <span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">/</span> <span style="color: #20b2aa;">(</span>NIR <span style="color: #00ffff;">+</span> RED <span style="color: #00ffff;">+</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">))</span> * <span style="color: #20b2aa;">(</span><span style="color: #daa520;">1</span> <span style="color: #00ffff;">-</span> <span style="color: #20b2aa;">((((</span>NIR^<span style="color: #daa520;">2</span> <span style="color: #00ffff;">-</span> RED^<span style="color: #daa520;">2</span><span style="color: #20b2aa;">)</span> * <span style="color: #daa520;">2</span> <span style="color: #00ffff;">+</span> <span style="color: #20b2aa;">(</span>NIR * <span style="color: #daa520;">1</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">+</span> <span style="color: #20b2aa;">(</span>RED * <span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">/</span> <span style="color: #20b2aa;">(</span>NIR <span style="color: #00ffff;">+</span> RED <span style="color: #00ffff;">+</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">5</span><span style="color: #20b2aa;">))</span> * <span style="color: #daa520;">0</span>.<span style="color: #daa520;">25</span><span style="color: #20b2aa;">))</span> <span style="color: #00ffff;">-</span> <span style="color: #20b2aa;">((</span>RED <span style="color: #00ffff;">-</span> <span style="color: #daa520;">0</span>.<span style="color: #daa520;">125</span><span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">/</span> <span style="color: #20b2aa;">(</span><span style="color: #daa520;">1</span> <span style="color: #00ffff;">-</span> RED<span style="color: #20b2aa;">))}</span>,                   
                        SLAVI   <span style="color: #00ffff;">=</span> <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>RED, MIR<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>NIR <span style="color: #00ffff;">/</span> <span style="color: #20b2aa;">(</span>RED <span style="color: #00ffff;">+</span> MIR<span style="color: #20b2aa;">)}</span>,
                        EVI             <span style="color: #00ffff;">=</span> <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>NIR, RED, BLUE<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>G * <span style="color: #20b2aa;">((</span>NIR <span style="color: #00ffff;">-</span> RED<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">/</span> <span style="color: #20b2aa;">(</span>NIR <span style="color: #00ffff;">+</span> C<span style="color: #daa520;">1</span> * RED <span style="color: #00ffff;">-</span> C<span style="color: #daa520;">2</span> * BLUE <span style="color: #00ffff;">+</span> L<span style="color: #20b2aa;">))}</span><span style="color: #00bfff;"># </span><span style="color: #00bfff;">include a G or L specification in command</span>
        <span style="color: #20b2aa;">)</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Get arguments and check for mising arguments</span>
        args <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">lapply</span><span style="color: #20b2aa;">(</span>indices, <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>index<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                                need <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">formals</span><span style="color: #20b2aa;">(</span>INDICES<span style="color: #20b2aa;">[[</span>index<span style="color: #20b2aa;">]]))</span>        
                                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">any</span><span style="color: #20b2aa;">(</span>!need <span style="color: #00ffff;">%</span><span style="color: #ff00ff;">in</span><span style="color: #00ffff;">%</span> <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>bands<span style="color: #20b2aa;">)))</span> <span style="color: #ff00ff;">stop</span><span style="color: #20b2aa;">(</span>Band <span style="color: #ff6347;">specification</span><span style="color: #20b2aa;">(</span>s<span style="color: #20b2aa;">)</span> of <span style="color: #00ffff;">&gt;&gt;</span> , <span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>bands<span style="color: #20b2aa;">)[</span>!<span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>bands<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">%</span><span style="color: #ff00ff;">in</span><span style="color: #00ffff;">%</span> need<span style="color: #20b2aa;">]</span>, collapse <span style="color: #00ffff;">=</span> ,<span style="color: #20b2aa;">)</span>, 
                                                         <span style="color: #00ffff;">&lt;&lt;</span> are missing or do not match layer names <span style="color: #ff00ff;">in</span> the brick<span style="color: #00ffff;">/</span>stack. \nPlease specify the correct layer number or name <span style="color: #ff00ff;">in</span> a list, e.g. bands <span style="color: #00ffff;">=</span> <span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>RED <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">'B</span><span style="color: #daa520;">4</span><span style="color: #00ff00;">'</span>, NIR <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">'B</span><span style="color: #daa520;">5</span><span style="color: #00ff00;">'</span><span style="color: #20b2aa;">)</span>, call. <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>
                                need <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">unlist</span><span style="color: #20b2aa;">(</span>bands<span style="color: #20b2aa;">[</span>need<span style="color: #20b2aa;">])</span>
                        <span style="color: #20b2aa;">})</span>
        <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>args<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&lt;-</span> indices 

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">We do this in a separate step, so we can throw an error before we start the calculations</span>
        inList <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">lapply</span><span style="color: #20b2aa;">(</span>indices, <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>index<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>verbose<span style="color: #20b2aa;">)</span> <span style="color: #ff6347;">print</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span>Calculating , index<span style="color: #20b2aa;">))</span>
                        m<span style="color: #00ffff;">&lt;-</span>     <span style="color: #ff6347;">overlay</span><span style="color: #20b2aa;">(</span>inputRaster<span style="color: #20b2aa;">[[</span>args<span style="color: #20b2aa;">[[</span>index<span style="color: #20b2aa;">]]]]</span>, fun <span style="color: #00ffff;">=</span> INDICES<span style="color: #20b2aa;">[[</span>index<span style="color: #20b2aa;">]])</span>
                        <span style="color: #20b2aa;">})</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Combine and return</span>
        outStack <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff6347;">stack</span><span style="color: #20b2aa;">(</span>inList<span style="color: #20b2aa;">)</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Write file if filename is provided. Doing it this way we write the file twice. We could provide filenames to overlay instead and return a stack so we only write once. </span>
        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">But then we have an output of n single files instead of one multi-layer file containing all indices.</span>
        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Maybe we should make this optional</span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">any</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">grepl</span><span style="color: #20b2aa;">(</span>file, <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">list</span><span style="color: #20b2aa;">(</span>...<span style="color: #20b2aa;">)))))</span> outStack <span style="color: #00ffff;">&lt;-</span>  <span style="color: #ff6347;">writeRaster</span><span style="color: #20b2aa;">(</span>outStack, ...<span style="color: #20b2aa;">)</span>

        <span style="color: #ff6347;">names</span><span style="color: #20b2aa;">(</span>outStack<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">&lt;-</span> indices       
        <span style="color: #ff00ff;">return</span><span style="color: #20b2aa;">(</span>outStack<span style="color: #20b2aa;">)</span>
<span style="color: #20b2aa;">}</span>
</pre>
</div>
</div>
</div>
