html/RStoolbox_0.01_(2014-5-6_by_).html
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> superClass.R</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param nSamples number of samples per land cover class</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param filename path to output file (optional). If \code{NULL}, standard raster handling will apply, i.e. storage either in memory or in the raster temp directory.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param maskRaster Raster layer containing a binary mask to exclude areas from prediction.</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param verbose logical. prints progress, statistics and graphics during execution</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param predict logical. \code{TRUE} (default) will return a classified map, \code{FALSE} will only train the classifier</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@param ... further arguments to be passed to randomForest</span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@return A list containing [[</span><span style="color: #daa520;">1</span><span style="color: #00bfff;">]] the model, [[</span><span style="color: #daa520;">2</span><span style="color: #00bfff;">]] the predicted raster and [[</span><span style="color: #daa520;">3</span><span style="color: #00bfff;">]] the class mapping  </span>
<span style="color: #00bfff;"># </span><span style="color: #00bfff;">@seealso \code{\link{randomForest}} </span>
<span style="color: #00bfff;"># </span><span style="color: #ffa500;">@export</span>
<span style="color: #ff6347;">superClass</span> <span style="color: #00ffff;">&lt;-</span> <span style="color: #ff00ff;">function</span><span style="color: #20b2aa;">(</span>inputRaster, trainingData, classAttributes <span style="color: #00ffff;">=</span> <span style="color: #daa520;">NULL</span>, nSamples <span style="color: #00ffff;">=</span> <span style="color: #daa520;">100</span>, filename <span style="color: #00ffff;">=</span> <span style="color: #daa520;">NULL</span>, maskRaster <span style="color: #00ffff;">=</span> <span style="color: #daa520;">NULL</span>, verbose <span style="color: #00ffff;">=</span> <span style="color: #daa520;">FALSE</span>, predict <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span>, overwrite <span style="color: #00ffff;">=</span> <span style="color: #daa520;">TRUE</span>, ...<span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
        <span style="color: #00bfff;"># </span><span style="color: #00bfff;">TODO: point vector data</span>
        <span style="color: #00bfff;"># </span><span style="color: #00bfff;">TODO: enable regression mode</span>
        <span style="color: #00bfff;"># </span><span style="color: #00bfff;">TODO: cross-validation</span>
        <span style="color: #00bfff;"># </span><span style="color: #00bfff;">TODO: make classifier modular</span>
        <span style="color: #00bfff;"># </span><span style="color: #00bfff;">TODO: add examples</span>
        <span style="color: #00bfff;"># </span><span style="color: #00bfff;">TODO: check applicability of raster:::.intersectExtent </span>
        <span style="color: #00bfff;"># </span><span style="color: #00bfff;">DISCUSS: demo data</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Filetypes</span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>!<span style="color: #ff6347;">inherits</span><span style="color: #20b2aa;">(</span>inputRaster, Raster<span style="color: #20b2aa;">))</span> <span style="color: #ff00ff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"inputRaster must be a raster object (RasterLayer,RasterBrick or RasterStack)"</span>, call.<span style="color: #00ffff;">=</span><span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span>!<span style="color: #ff6347;">inherits</span><span style="color: #20b2aa;">(</span>trainingData, SpatialPolygonsDataFrame<span style="color: #20b2aa;">))</span> <span style="color: #ff00ff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"traingData must be a SpatialPolygonsDataFrame"</span>, call.<span style="color: #00ffff;">=</span><span style="color: #daa520;">FALSE</span><span style="color: #20b2aa;">)</span>

        <span style="color: #00bfff;">## </span><span style="color: #00bfff;">Attribute column</span>
        <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">is.null</span><span style="color: #20b2aa;">(</span>classAttributes<span style="color: #20b2aa;">)){</span>
                <span style="color: #ff00ff;">if</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">ncol</span><span style="color: #20b2aa;">(</span>trainingData<span style="color: #20b2aa;">)</span> <span style="color: #00ffff;">==</span> <span style="color: #daa520;">1</span><span style="color: #20b2aa;">)</span> <span style="color: #20b2aa;">{</span>
                        classAttributes <span style="color: #00ffff;">&lt;-</span> <span style="color: #daa520;">1</span>
                        <span style="color: #ff00ff;">message</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"You did not specify the classAttributes column. \nSince your trainingData only contains one column we assume this is it"</span><span style="color: #20b2aa;">)</span>
                <span style="color: #20b2aa;">}</span> <span style="color: #ff00ff;">else</span> <span style="color: #20b2aa;">{</span>
                        <span style="color: #ff00ff;">stop</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">paste</span><span style="color: #20b2aa;">(</span><span style="color: #00ff00;">"Dontt know which column in trainingData contains the class attribute. \nPlease specify classAttributes as one of: , paste(colnames(trainingData@data),collapse=, )), call. = FALSE)</span>
<span style="color: #00ff00;">                }</span>
<span style="color: #00ff00;">        } </span>
<span style="color: #00ff00;">        if(!classAttributes %in% colnames(trainingData@data)) </span>
<span style="color: #00ff00;">                stop(paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(The column , classAttributes,  does not exist in trainingData. \nAvailable columns are: , colnames(trainingData@data,collapse=, )), call. = FALSE) </span>

<span style="color: #00ff00;">        ## Check projections</span>
<span style="color: #00ff00;">        if(!compareCRS(inputRaster, trainingData)) </span>
<span style="color: #00ff00;">                stop(Projection of trainingData does not match inputRaster)</span>
<span style="color: #00ff00;">                ## DISCUSS: Should we do a spTransform of vector data here, or require proper projection from the user?</span>

<span style="color: #00ff00;">        ## Check overlap of vector and raster data      </span>
<span style="color: #00ff00;">        if(!gIntersects(as(extent(inputRaster),SpatialPolygons), as(extent(trainingData),SpatialPolygons))) </span>
<span style="color: #00ff00;">                stop(inputRaster and trainingData do not overlap)</span>

<span style="color: #00ff00;">        ## Calculate area weighted number of samples per polygon</span>
<span style="color: #00ff00;">        ## this way we'll end up with n &gt; nSamples, but make sure to sample each polygon at least once</span>
<span style="color: #00ff00;">        if(is.projected(trainingData)){</span>
<span style="color: #00ff00;">                trainingData[[area]] &lt;- gArea(trainingData, byid = TRUE)</span>
<span style="color: #00ff00;">        } else {</span>
<span style="color: #00ff00;">                trainingData[[area]] &lt;- areaPolygon(trainingData)               </span>
<span style="color: #00ff00;">        }</span>

<span style="color: #00ff00;">        ## Calculate optimal nSamples per class</span>
<span style="color: #00ff00;">        trainingData@data[[order]] &lt;- </span><span style="color: #daa520;">1</span><span style="color: #00ff00;">:nrow(trainingData)              </span>
<span style="color: #00ff00;">        weights &lt;- ddply(trainingData@data, .variables = classAttributes, .fun = here(mutate), nSamplesClass = ceiling(nSamples * area / sum(area)))</span>
<span style="color: #00ff00;">        trainingData@data &lt;- weights[order(weights$order),]</span>

<span style="color: #00ff00;">        ## Get random coordinates within polygons</span>
<span style="color: #00ff00;">        xy  &lt;- lapply(seq_along(trainingData), function(i_poly){        </span>
<span style="color: #00ff00;">                                pts &lt;- spsample(trainingData[i_poly, ], type = random, n = trainingData@data[i_poly,nSamplesClass], iter = </span><span style="color: #daa520;">20</span><span style="color: #00ff00;">) </span>
<span style="color: #00ff00;">                        })</span>
<span style="color: #00ff00;">        xy &lt;- do.call(rbind, xy)</span>

<span style="color: #00ff00;">        ### Display, verbose only</span>
<span style="color: #00ff00;">        if(verbose) {</span>
<span style="color: #00ff00;">                plot(inputRaster,</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">)</span>
<span style="color: #00ff00;">                plot(trainingData, add = T)</span>
<span style="color: #00ff00;">                points(xy, pch = </span><span style="color: #daa520;">3</span><span style="color: #00ff00;">, cex = </span><span style="color: #daa520;">0</span><span style="color: #00ff00;">.</span><span style="color: #daa520;">5</span><span style="color: #00ff00;">)</span>
<span style="color: #00ff00;">        }       </span>

<span style="color: #00ff00;">        ## Extract response and predictors and combine in final training set</span>
<span style="color: #00ff00;">        if(verbose) print(Begin extract)</span>
<span style="color: #00ff00;">        dataSet &lt;- data.frame(</span>
<span style="color: #00ff00;">                        response = as.factor(over(x = xy, y = trainingData)[[classAttributes]]),</span>
<span style="color: #00ff00;">                        extract(inputRaster, xy, cellnumbers = TRUE))</span>

<span style="color: #00ff00;">        ## Discard duplicate cells</span>
<span style="color: #00ff00;">        dataSet &lt;- dataSet[!duplicated(dataSet[,cells]),]</span>
<span style="color: #00ff00;">        dataSet &lt;- dataSet[,colnames(dataSet) != cells]</span>

<span style="color: #00ff00;">        ## Unique classes</span>
<span style="color: #00ff00;">        classes &lt;- unique(trainingData[[classAttributes]])</span>
<span style="color: #00ff00;">        classMapping &lt;- data.frame(classID = as.numeric(classes), class = levels(classes))</span>

<span style="color: #00ff00;">        ## TRAIN ######################### </span>
<span style="color: #00ff00;">        if(verbose) print(Starting to calculate random forest model) </span>
<span style="color: #00ff00;">        model &lt;- randomForest(response ~ . , data = dataSet, na.action = na.omit, confusion = TRUE, ...)                </span>

<span style="color: #00ff00;">        ## PREDICT ######################### </span>
<span style="color: #00ff00;">        progress &lt;- none</span>
<span style="color: #00ff00;">        if(verbose) { print(Starting spatial predict)</span>
<span style="color: #00ff00;">                progress &lt;- text</span>
<span style="color: #00ff00;">        }</span>

<span style="color: #00ff00;">        ## Don't know whether we need this, who would be crazy enough to do more than </span><span style="color: #daa520;">255</span><span style="color: #00ff00;"> classes...</span>
<span style="color: #00ff00;">        ifelse(length(classes) &lt; </span><span style="color: #daa520;">255</span><span style="color: #00ff00;">, dataType &lt;- INT</span><span style="color: #daa520;">1</span><span style="color: #00ff00;">U,  dataType &lt;- INT</span><span style="color: #daa520;">2</span><span style="color: #00ff00;">U)</span>

<span style="color: #00ff00;">        if(is.null(filename)){</span>
<span style="color: #00ff00;">                spatPred &lt;- predict(inputRaster, model, progress = progress, dataType = dataType, overwrite = overwrite)</span>
<span style="color: #00ff00;">        } else {</span>
<span style="color: #00ff00;">                spatPred &lt;- predict(inputRaster, model, filename = filename, progress = progress, dataType = dataType, overwrite = overwrite)</span>
<span style="color: #00ff00;">        }</span>

<span style="color: #00ff00;">        ## Print summary stats</span>
<span style="color: #00ff00;">        if(verbose)</span>
<span style="color: #00ff00;">                print(paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(paste</span><span style="color: #daa520;">0</span><span style="color: #00ff00;">(rep(*,</span><span style="color: #daa520;">20</span><span style="color: #00ff00;">), collapse = "</span><span style="color: #20b2aa;">)</span>, Classification summary  ,<span style="color: #ff6347;">paste</span><span style="color: #daa520;">0</span><span style="color: #20b2aa;">(</span><span style="color: #ff6347;">rep</span><span style="color: #20b2aa;">(</span>*,<span style="color: #daa520;">20</span><span style="color: #20b2aa;">)</span>, collapse <span style="color: #00ffff;">=</span> <span style="color: #00ff00;">")))</span>
<span style="color: #00ff00;">                ## Samples total</span>
<span style="color: #00ff00;">                ## Samples per class</span>
<span style="color: #00ff00;">                print(model)</span>
<span style="color: #00ff00;">        ## TODO: calculate users,producer's accuracies and kappas</span>

<span style="color: #00ff00;">        ## DISCUSS: should we return sample points as well?</span>
<span style="color: #00ff00;">        return(list(model = model, map = spatPred, classMapping = classMapping)) </span>

<span style="color: #00ff00;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: tian</p>
<p class="date">Created: 2014-09-22 Mon 15:52</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.7c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
